[
    {
        "state": "ALABAMA",
        "commonName": "Yellow Jessamine",
        "scientificName": "Gelsemium sempervirens",
        "image": "alabama_state_flower.jpg",
        "stateFlower": "Camellia",
        "statePlant": "Longleaf Pine",
        "stateTree": "Southern Longleaf Pine",
        "stateCrop": ["Cotton", "Soybeans", "Peanuts", "Corn", "Wheat"],
        "commonFlowers": ["Azalea", "Black-eyed Susan", "Butterfly Weed", "Coreopsis", "Goldenrod"],
        "gardeningFacts": [
            {"id": "fact1", "Alabama's climate is favorable for growing a variety of plants, including both tropical and temperate species."},
            {"id": "fact2", "The state's rich soil and ample rainfall support a thriving agricultural industry, with crops like cotton, soybeans, and peanuts being major contributors to the economy."},
            {"id": "fact3", "Longleaf pine forests are an essential part of Alabama's ecosystem, providing habitat for diverse plant and animal species."},
            {"id": "fact4", "Camellias, the state flower, are popular ornamental plants known for their beautiful flowers and glossy evergreen foliage."},
            {"id": "fact5", "Alabama's native wildflowers, such as black-eyed Susans and goldenrod, add vibrant colors to the landscape and attract pollinators."},
            {"id": "fact6", "Gardening enthusiasts in Alabama often cultivate azaleas, which thrive in the state's acidic soil and mild winters."},
            {"id": "fact7", "Butterfly weed, a type of milkweed native to Alabama, is a favorite among gardeners for its bright orange flowers and ability to attract butterflies."},
            {"id": "fact8", "Coreopsis, also known as tickseed, is a low-maintenance perennial that blooms profusely in Alabama's sunny gardens."},
            {"id": "fact9", "Alabama gardeners can enjoy a long growing season, with mild temperatures in spring and fall and warm summers ideal for heat-loving crops."},
            {"id": "fact10", "Goldenrod, a native wildflower, is often wrongly blamed for causing hay fever. Its pollen is too heavy to be wind-dispersed and is primarily pollinated by insects."},
            {"id": "fact11", "Alabama's agricultural diversity allows for the production of a wide range of crops, from traditional staples like corn and wheat to specialty crops like pecans and peaches."},
            {"id": "fact12", "Alabama's state tree, the southern longleaf pine, was once a dominant species in the state's forests and is now a symbol of conservation efforts to restore its habitat."},
            {"id": "fact13", "Gardening in Alabama can be challenging due to the state's variable climate, with occasional droughts, heavy rains, and temperature extremes."},
            {"id": "fact14", "Alabama's rich cultural heritage includes traditional gardening practices passed down through generations, such as planting by the phases of the moon and companion planting."},
            {"id": "fact15", "The state's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact16", "Alabama's mild winters allow for year-round gardening activities, with cool-season crops like kale and broccoli thriving in the cooler months."},
            {"id": "fact17", "Gardeners in Alabama often use raised beds and container gardening to overcome challenges such as poor soil quality and limited space."},
            {"id": "fact18", "Alabama's coastal regions offer unique gardening opportunities, with plants adapted to salt spray and sandy soils thriving in beachfront gardens."},
            {"id": "fact19", "Alabama's diverse landscapes, from mountains to coastal plains, provide a range of microclimates suitable for growing a wide variety of plants."},
            {"id": "fact20", "The state's network of botanical gardens and arboretums showcase Alabama's native flora and provide inspiration for home gardeners."}
        ]
    },
    {
        "state": "ALASKA",
        "commonName": "Forget-me-not",
        "scientificName": "Myosotis alpestris",
        "image": "alaska_state_flower.jpg",
        "stateFlower": "Forget-me-not",
        "statePlant": "Forget-me-not",
        "stateTree": "Sitka Spruce",
        "stateCrop": [],
        "commonFlowers": ["Fireweed", "Lupine", "Arctic Poppy", "Alpine Rose", "Mountain Aven"],
        "gardeningFacts": [
            {"id": "fact1", "Alaska's extreme climate presents unique challenges for gardeners, with long winters and short, intense growing seasons."},
            {"id": "fact2", "Forget-me-nots, the state flower, are well-suited to Alaska's cool climate and are often found growing wild in meadows and along streams."},
            {"id": "fact3", "Sitka spruce, the state tree, is an important timber species in Alaska and is valued for its strong, straight trunk and high-quality wood."},
            {"id": "fact4", "Alaska's wild landscapes are home to a diverse array of native plants, including fireweed, lupine, and arctic poppy."},
            {"id": "fact5", "Gardening in Alaska often requires innovative techniques, such as using cold frames and hoop houses to extend the growing season."},
            {"id": "fact6", "Fireweed, with its tall spikes of pink flowers, is a common sight along roadsides and in open meadows throughout Alaska."},
            {"id": "fact7", "Lupine, with its colorful spikes of flowers, is a favorite among Alaska gardeners for its ability to thrive in poor soils and harsh conditions."},
            {"id": "fact8", "Arctic poppy, with its delicate yellow flowers, is a hardy perennial that blooms in Alaska's short summer season."},
            {"id": "fact9", "Alpine rose, with its small pink flowers, is a tough shrub that grows in the alpine and subalpine regions of Alaska."},
            {"id": "fact10", "Mountain aven, with its white flowers and fuzzy leaves, is a common alpine plant in Alaska's mountains."},
            {"id": "fact11", "Alaska's native plants have adapted to survive in extreme conditions, including cold temperatures, strong winds, and permafrost."},
            {"id": "fact12", "Gardening is an important part of Alaska's food security, with many residents growing their own fruits and vegetables to supplement store-bought produce."},
            {"id": "fact13", "Alaska's short growing season means that gardeners must make the most of the available sunlight, often planting crops in raised beds or containers to maximize warmth and sunlight."},
            {"id": "fact14", "Alaska's coastal regions have milder climates than inland areas, with ocean breezes moderating temperatures and reducing the risk of frost."},
            {"id": "fact15", "Gardening in Alaska requires careful planning and preparation, with gardeners often starting seeds indoors and transplanting seedlings outdoors once the weather warms up."},
            {"id": "fact16", "Alaska's long summer days provide ample sunlight for plant growth, with some areas experiencing near-constant daylight during the summer solstice."},
            {"id": "fact17", "Gardening in Alaska fosters a strong sense of community, with neighbors often sharing tips, seeds, and produce with one another."},
            {"id": "fact18", "Alaska's native plants play important roles in traditional Native Alaskan cultures, providing food, medicine, and materials for crafts and ceremonies."},
            {"id": "fact19", "Alaska's cold winters help control pests and diseases, reducing the need for chemical pesticides and fungicides in the garden."},
            {"id": "fact20", "The state's vast wilderness areas offer endless opportunities for exploration and discovery, with many gardeners drawing inspiration from Alaska's natural beauty."}
        ]
    },
    {
        "state": "ARIZONA",
        "commonName": "Saguaro Cactus Blossom",
        "scientificName": "Carnegiea gigantea",
        "image": "arizona_state_flower.jpg",
        "stateFlower": "Saguaro Cactus Blossom",
        "statePlant": "Saguaro Cactus",
        "stateTree": "Palo Verde",
        "stateCrop": [],
        "commonFlowers": ["Desert Marigold", "Brittlebush", "Penstemon", "Ocotillo", "Prickly Pear Cactus"],
        "gardeningFacts": [
            {"id": "fact1", "Arizona's diverse climate allows for a wide range of gardening opportunities, from desert landscapes to mountain gardens."},
            {"id": "fact2", "The saguaro cactus blossom, the state flower, blooms in late spring and early summer, attracting pollinators with its large, white flowers."},
            {"id": "fact3", "Saguaro cacti, with their iconic silhouette, are a symbol of the Arizona desert and can live for over 150 years."},
            {"id": "fact4", "Palo verde trees, with their green bark and yellow flowers, are well-adapted to Arizona's arid climate and provide shade and beauty to desert landscapes."},
            {"id": "fact5", "Arizona's native wildflowers, such as desert marigolds and brittlebush, add bursts of color to the desert landscape after winter rains."},
            {"id": "fact6", "Desert marigolds, with their bright yellow flowers, are drought-tolerant perennials that thrive in Arizona's dry conditions."},
            {"id": "fact7", "Brittlebush, with its silver-green foliage and yellow flowers, is a hardy shrub that grows in the Sonoran Desert and other arid regions of Arizona."},
            {"id": "fact8", "Penstemons, with their tubular flowers in shades of pink, purple, and red, are popular ornamental plants in Arizona's gardens."},
            {"id": "fact9", "Ocotillo, with its spiny stems and bright red flowers, is a striking desert plant that blooms after rainfall."},
            {"id": "fact10", "Prickly pear cacti, with their paddle-shaped pads and colorful flowers, are common sights in Arizona's desert landscapes."},
            {"id": "fact11", "Arizona's native plants are well-adapted to the state's hot, dry climate, requiring little water once established."},
            {"id": "fact12", "Gardening in Arizona often involves xeriscaping, a landscaping method that uses drought-tolerant plants and efficient irrigation techniques."},
            {"id": "fact13", "Xeriscaping helps conserve water and reduces the need for supplemental irrigation, making it well-suited to Arizona's desert environment."},
            {"id": "fact14", "Arizona's desert regions experience extreme temperature fluctuations, with hot days and cool nights creating challenging growing conditions for plants."},
            {"id": "fact15", "Gardeners in Arizona often use shade structures and mulch to protect plants from the intense sun and retain soil moisture."},
            {"id": "fact16", "Arizona's low humidity levels and abundant sunshine make it an ideal location for growing citrus fruits, such as oranges, lemons, and grapefruits."},
            {"id": "fact17", "Gardening in Arizona's higher elevations, such as in the mountains of Flagstaff and Prescott, offers cooler temperatures and a longer growing season."},
            {"id": "fact18", "Arizona's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Spanish, and Mexican cultures."},
            {"id": "fact19", "Arizona's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact20", "The state's commitment to sustainable gardening practices, such as water conservation and native plant landscaping, helps protect Arizona's natural resources and promote environmental stewardship."}
        ]
    },
    {
        "state": "ARKANSAS",
        "commonName": "Apple Blossom",
        "scientificName": "Malus domestica",
        "image": "arkansas_state_flower.jpg",
        "stateFlower": "Apple Blossom",
        "statePlant": "Loblolly Pine",
        "stateTree": "Loblolly Pine",
        "stateCrop": ["Rice", "Soybeans", "Corn", "Wheat", "Cotton"],
        "commonFlowers": ["Rose", "Daisy", "Tulip", "Violet", "Lily"],
        "gardeningFacts": [
            {"id": "fact1", "Arkansas's climate varies from subtropical in the south to continental in the north, providing a diverse range of gardening opportunities."},
            {"id": "fact2", "Apple blossoms, the state flower, are a beautiful sign of spring in Arkansas, with orchards blooming across the state."},
            {"id": "fact3", "Loblolly pines, the state tree, are the most common pine species in Arkansas and are valued for their timber and as habitat for wildlife."},
            {"id": "fact4", "Arkansas's fertile soil and abundant rainfall support a thriving agricultural industry, with crops like rice, soybeans, and corn being major contributors to the economy."},
            {"id": "fact5", "Arkansas's native flowers, such as roses, daisies, and tulips, are popular choices for gardeners seeking to add color and fragrance to their landscapes."},
            {"id": "fact6", "Roses, with their delicate petals and sweet scent, are a favorite among Arkansas gardeners for their beauty and versatility."},
            {"id": "fact7", "Daisies, with their cheerful blooms and long-lasting flowers, are easy to grow and attract pollinators to the garden."},
            {"id": "fact8", "Tulips, with their vibrant colors and elegant blooms, are a favorite spring flower in Arkansas's gardens and landscapes."},
            {"id": "fact9", "Violets, with their heart-shaped leaves and delicate flowers, are native to Arkansas and thrive in shady woodland areas."},
            {"id": "fact10", "Lilies, with their showy flowers and tall stalks, are a striking addition to Arkansas gardens and landscapes."},
            {"id": "fact11", "Arkansas's diverse geography, including mountains, forests, and rivers, provides a variety of microclimates suitable for growing a wide range of plants."},
            {"id": "fact12", "Gardening in Arkansas often involves dealing with pests such as aphids, Japanese beetles, and tomato hornworms, which can damage crops and ornamental plants."},
            {"id": "fact13", "Arkansas's mild winters and long growing season allow for year-round gardening activities, with cool-season crops like lettuce and spinach thriving in the winter months."},
            {"id": "fact14", "Arkansas's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact15", "Arkansas's rich cultural heritage is reflected in its gardening traditions, with many families passing down gardening knowledge and skills from generation to generation."},
            {"id": "fact16", "Arkansas gardeners often use raised beds and container gardening to overcome challenges such as poor soil quality and limited space."},
            {"id": "fact17", "Arkansas's rivers and lakes provide irrigation water for crops and gardens, as well as recreational opportunities for fishing and boating."},
            {"id": "fact18", "Arkansas's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact19", "The state's commitment to sustainable gardening practices, such as composting and mulching, helps protect Arkansas's natural resources and promote environmental stewardship."},
            {"id": "fact20", "Arkansas's annual garden tours, plant sales, and gardening events bring together enthusiasts from across the state to share tips, swap plants, and celebrate their love of gardening."}
        ]
    },
    {
        "state": "CALIFORNIA",
        "commonName": "California Poppy",
        "scientificName": "Eschscholzia californica",
        "image": "california_state_flower.jpg",
        "stateFlower": "California Poppy",
        "statePlant": "California Poppy",
        "stateTree": "California Redwood",
        "stateCrop": ["Almonds", "Grapes", "Strawberries", "Oranges", "Lemons"],
        "commonFlowers": ["Rose", "Lily", "Daisy", "Tulip", "Lavender"],
        "gardeningFacts": [
            {"id": "fact1", "California's diverse climate allows for a wide range of gardening opportunities, from coastal gardens to mountain landscapes."},
            {"id": "fact2", "California poppies, the state flower, blanket the hillsides with their golden blooms in the spring, creating spectacular displays."},
            {"id": "fact3", "California redwoods, the state tree, are the tallest trees in the world and are iconic symbols of the state's natural beauty."},
            {"id": "fact4", "California's fertile soil and Mediterranean climate support a thriving agricultural industry, with crops like almonds, grapes, and strawberries being major contributors to the economy."},
            {"id": "fact5", "California's native flowers, such as roses, lilies, and daisies, are popular choices for gardeners seeking to add color and fragrance to their landscapes."},
            {"id": "fact6", "Roses, with their wide range of colors and fragrances, are a favorite among California gardeners for their beauty and versatility."},
            {"id": "fact7", "Lilies, with their elegant blooms and tall stalks, are a striking addition to California gardens and landscapes."},
            {"id": "fact8", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact9", "Tulips, with their vibrant colors and elegant flowers, are a favorite spring flower in California's gardens and landscapes."},
            {"id": "fact10", "Lavender, with its fragrant flowers and silvery foliage, is a popular herb in California gardens and is valued for its medicinal and culinary uses."},
            {"id": "fact11", "California's diverse geography, including mountains, deserts, and coastal regions, provides a variety of microclimates suitable for growing a wide range of plants."},
            {"id": "fact12", "Gardening in California often involves dealing with challenges such as drought, wildfires, and invasive pests, which can damage crops and ornamental plants."},
            {"id": "fact13", "California's mild winters and long growing season allow for year-round gardening activities, with cool-season crops like lettuce and spinach thriving in the winter months."},
            {"id": "fact14", "California's agricultural extension services provide valuable resources and support to gardeners, offering advice on water conservation, pest management, and sustainable gardening practices."},
            {"id": "fact15", "California's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Spanish, and Asian cultures."},
            {"id": "fact16", "California gardeners often use raised beds, container gardening, and drip irrigation to conserve water and maximize space in their gardens."},
            {"id": "fact17", "California's diverse plant life, including many native and exotic species, attracts gardeners from around the world seeking to explore its botanical treasures."},
            {"id": "fact18", "California's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact19", "The state's commitment to sustainable gardening practices, such as composting, mulching, and organic gardening, helps protect California's natural resources and promote environmental stewardship."},
            {"id": "fact20", "California's vibrant gardening community hosts numerous events, workshops, and plant sales throughout the year, bringing together enthusiasts to share tips, swap plants, and celebrate their love of gardening."}
        ]
    },
    {
        "state": "COLORADO",
        "commonName": "Rocky Mountain Columbine",
        "scientificName": "Aquilegia caerulea",
        "image": "colorado_state_flower.jpg",
        "stateFlower": "Rocky Mountain Columbine",
        "statePlant": "Colorado Blue Spruce",
        "stateTree": "Colorado Blue Spruce",
        "stateCrop": [],
        "commonFlowers": ["Sunflower", "Lupine", "Coneflower", "Penstemon", "Indian Paintbrush"],
        "gardeningFacts": [
            {"id": "fact1", "Colorado's climate varies greatly depending on altitude and location, with diverse gardening opportunities ranging from mountain gardens to high plains landscapes."},
            {"id": "fact2", "Rocky Mountain columbines, the state flower, are delicate wildflowers that bloom in the spring and are prized for their unique bi-color petals."},
            {"id": "fact3", "Colorado blue spruces, the state tree, are popular ornamental trees valued for their striking blue-green foliage and graceful form."},
            {"id": "fact4", "Colorado's arid climate and high altitude present challenges for gardeners, including intense sunlight, low humidity, and sudden temperature fluctuations."},
            {"id": "fact5", "Colorado's native flowers, such as sunflowers, lupines, and coneflowers, are well-adapted to the state's harsh growing conditions and are favorites among gardeners."},
            {"id": "fact6", "Sunflowers, with their cheerful blooms and edible seeds, are a common sight in Colorado's gardens and landscapes."},
            {"id": "fact7", "Lupines, with their tall spikes of flowers in shades of blue, purple, and pink, are popular perennials in Colorado's mountain gardens."},
            {"id": "fact8", "Coneflowers, with their daisy-like flowers and cone-shaped centers, are drought-tolerant perennials that thrive in Colorado's dry climate."},
            {"id": "fact9", "Penstemons, with their tubular flowers in shades of red, purple, and pink, are well-suited to Colorado's rocky soils and sunny slopes."},
            {"id": "fact10", "Indian paintbrush, with its vibrant red, orange, and yellow flowers, is a striking wildflower that grows in meadows and alpine areas throughout Colorado."},
            {"id": "fact11", "Colorado's gardeners often use mulch, drip irrigation, and xeriscaping techniques to conserve water and reduce the need for supplemental irrigation."},
            {"id": "fact12", "Gardening in Colorado requires careful attention to soil quality and drainage, with many gardeners amending their soil with organic matter to improve fertility and structure."},
            {"id": "fact13", "Colorado's short growing season and frequent late spring frosts limit the types of plants that can be successfully grown, with many gardeners focusing on cold-hardy varieties."},
            {"id": "fact14", "Colorado's mountain communities have a strong tradition of community gardening, with shared plots, communal orchards, and cooperative greenhouses providing fresh produce to residents."},
            {"id": "fact15", "Colorado's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as water conservation and native plant landscaping, helps protect Colorado's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Colorado's annual garden festivals, plant sales, and garden tours attract gardening enthusiasts from across the state and beyond, fostering a sense of community and camaraderie among participants."},
            {"id": "fact18", "Colorado's wild landscapes, including national parks, forests, and wilderness areas, offer endless opportunities for outdoor recreation and exploration, inspiring gardeners with their natural beauty."},
            {"id": "fact19", "Colorado's gardening community is known for its resilience and resourcefulness, with gardeners finding creative solutions to overcome the challenges of gardening at high altitude and in a semi-arid climate."},
            {"id": "fact20", "Colorado's rich gardening heritage includes contributions from diverse cultural groups, including Native American, Hispanic, and European immigrants, each bringing their own traditions, techniques, and plants to the region."}
        ]
    },
    {
        "state": "CONNECTICUT",
        "commonName": "Mountain Laurel",
        "scientificName": "Kalmia latifolia",
        "image": "connecticut_state_flower.jpg",
        "stateFlower": "Mountain Laurel",
        "statePlant": "Mountain Laurel",
        "stateTree": "White Oak",
        "stateCrop": [],
        "commonFlowers": ["Rose", "Tulip", "Daisy", "Hydrangea", "Lily-of-the-Valley"],
        "gardeningFacts": [
            {"id": "fact1", "Connecticut's temperate climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Mountain laurel, the state flower, is a native evergreen shrub known for its showy clusters of pink or white flowers in late spring."},
            {"id": "fact3", "White oak, the state tree, is a stately hardwood tree valued for its strong, durable wood and wildlife habitat."},
            {"id": "fact4", "Connecticut's coastal location and maritime influence moderate temperatures and provide ample rainfall, creating ideal growing conditions for a variety of plants."},
            {"id": "fact5", "Connecticut's native flowers, such as roses, tulips, and daisies, are popular choices for gardeners seeking to add color and fragrance to their landscapes."},
            {"id": "fact6", "Roses, with their classic beauty and sweet fragrance, are a favorite among Connecticut gardeners for their versatility and abundance of varieties."},
            {"id": "fact7", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Connecticut's gardens and landscapes."},
            {"id": "fact8", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact9", "Hydrangeas, with their large, showy flowers and lush foliage, are popular ornamental shrubs in Connecticut's gardens and landscapes."},
            {"id": "fact10", "Lily-of-the-valley, with its fragrant white flowers and delicate foliage, is a shade-loving perennial that thrives in Connecticut's woodlands."},
            {"id": "fact11", "Connecticut's gardeners often face challenges such as deer, rabbits, and other wildlife that may damage crops and ornamental plants."},
            {"id": "fact12", "Gardening in Connecticut requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Connecticut's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Connecticut's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and colonial gardening practices."},
            {"id": "fact15", "Connecticut gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and organic gardening, helps protect Connecticut's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Connecticut's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and garden tours bring together enthusiasts from across the state to share tips, swap plants, and celebrate their love of gardening."},
            {"id": "fact19", "Connecticut's historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Connecticut's gardening community is known for its passion and dedication, with gardeners of all ages and backgrounds coming together to share their love of plants and gardening."}
        ]
    },
    {
        "state": "DELAWARE",
        "commonName": "Peach Blossom",
        "scientificName": "Prunus persica",
        "image": "delaware_state_flower.jpg",
        "stateFlower": "Peach Blossom",
        "statePlant": "American Holly",
        "stateTree": "American Holly",
        "stateCrop": [],
        "commonFlowers": ["Rose", "Daisy", "Tulip", "Lily", "Hydrangea"],
        "gardeningFacts": [
            {"id": "fact1", "Delaware's mild climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Peach blossoms, the state flower, herald the arrival of spring in Delaware, with orchards blooming across the state."},
            {"id": "fact3", "American holly, the state tree, is a native evergreen tree valued for its glossy green leaves and bright red berries."},
            {"id": "fact4", "Delaware's coastal location and maritime influence moderate temperatures and provide ample rainfall, creating ideal growing conditions for a variety of plants."},
            {"id": "fact5", "Delaware's native flowers, such as roses, daisies, and tulips, are popular choices for gardeners seeking to add color and fragrance to their landscapes."},
            {"id": "fact6", "Roses, with their classic beauty and sweet fragrance, are a favorite among Delaware gardeners for their versatility and abundance of varieties."},
            {"id": "fact7", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact8", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Delaware's gardens and landscapes."},
            {"id": "fact9", "Lilies, with their showy flowers and tall stalks, are a striking addition to Delaware gardens and landscapes."},
            {"id": "fact10", "Hydrangeas, with their large, showy flowers and lush foliage, are popular ornamental shrubs in Delaware's gardens and landscapes."},
            {"id": "fact11", "Delaware's gardeners often face challenges such as deer, rabbits, and other wildlife that may damage crops and ornamental plants."},
            {"id": "fact12", "Gardening in Delaware requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Delaware's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Delaware's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and colonial gardening practices."},
            {"id": "fact15", "Delaware gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and organic gardening, helps protect Delaware's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Delaware's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and garden tours bring together enthusiasts from across the state to share tips, swap plants, and celebrate their love of gardening."},
            {"id": "fact19", "Delaware's historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Delaware's gardening community is known for its passion and dedication, with gardeners of all ages and backgrounds coming together to share their love of plants and gardening."}
        ]
    },
    {
        "state": "FLORIDA",
        "commonName": "Orange Blossom",
        "scientificName": "Citrus sinensis",
        "image": "florida_state_flower.jpg",
        "stateFlower": "Orange Blossom",
        "statePlant": "Sabal Palm",
        "stateTree": "Sabal Palm",
        "stateCrop": ["Citrus Fruits", "Strawberries", "Tomatoes", "Cabbage", "Bell Peppers"],
        "commonFlowers": ["Hibiscus", "Bougainvillea", "Plumeria", "Bird of Paradise", "Bromeliad"],
        "gardeningFacts": [
            {"id": "fact1", "Florida's warm and humid climate provides ideal conditions for gardening year-round, with a wide variety of tropical and subtropical plants thriving in the state."},
            {"id": "fact2", "Orange blossoms, the state flower, perfume the air with their sweet fragrance in the spring, signaling the beginning of the citrus harvest season."},
            {"id": "fact3", "Sabal palms, also known as cabbage palms, are native to Florida and are valued for their graceful fronds and resilience to hurricanes."},
            {"id": "fact4", "Florida's sandy soils and abundant rainfall support a thriving agricultural industry, with citrus fruits, strawberries, and tomatoes being major crops."},
            {"id": "fact5", "Florida's native flowers, such as hibiscus, bougainvillea, and plumeria, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Hibiscus, with its large, showy flowers in shades of red, pink, and yellow, is a beloved flowering shrub in Florida's gardens and landscapes."},
            {"id": "fact7", "Bougainvillea, with its vibrant bracts and sprawling growth habit, is a drought-tolerant vine that thrives in Florida's warm climate."},
            {"id": "fact8", "Plumeria, also known as frangipani, is a tropical tree with fragrant flowers that are used to make leis and perfumes."},
            {"id": "fact9", "Bird of paradise, with its exotic flowers resembling a bird in flight, is a striking addition to Florida gardens and landscapes."},
            {"id": "fact10", "Bromeliads, with their colorful foliage and unique flowers, are popular ornamental plants in Florida's gardens and landscapes."},
            {"id": "fact11", "Florida's gardeners often face challenges such as pests, diseases, and extreme weather events like hurricanes and tropical storms."},
            {"id": "fact12", "Gardening in Florida requires careful attention to water management, with many gardeners using drip irrigation and mulching to conserve water and reduce runoff."},
            {"id": "fact13", "Florida's mild winters and long growing season allow for year-round gardening activities, with cool-season crops like lettuce and broccoli thriving in the winter months."},
            {"id": "fact14", "Florida's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact15", "Florida's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Hispanic, and Caribbean cultures."},
            {"id": "fact16", "Florida gardeners often use raised beds, container gardening, and hydroponics to overcome challenges such as poor soil quality and limited space."},
            {"id": "fact17", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect Florida's natural resources and promote environmental stewardship."},
            {"id": "fact18", "Florida's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact19", "The state's annual garden festivals, plant sales, and garden tours attract gardening enthusiasts from across the state and beyond, fostering a sense of community and camaraderie among participants."},
            {"id": "fact20", "Florida's gardening community is known for its innovation and creativity, with gardeners experimenting with new techniques and plant varieties to adapt to the state's unique growing conditions."}
        ]
    },
    {
        "state": "GEORGIA",
        "commonName": "Cherokee Rose",
        "scientificName": "Rosa laevigata",
        "image": "georgia_state_flower.jpg",
        "stateFlower": "Cherokee Rose",
        "statePlant": "Cherokee Rose",
        "stateTree": "Live Oak",
        "stateCrop": ["Peanuts", "Peaches", "Pecans", "Blueberries", "Cotton"],
        "commonFlowers": ["Azalea", "Dogwood", "Magnolia", "Hydrangea", "Camellia"],
        "gardeningFacts": [
            {"id": "fact1", "Georgia's mild climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Cherokee roses, the state flower, are native to Georgia and symbolize the state's beauty and resilience."},
            {"id": "fact3", "Live oaks, with their sprawling branches and evergreen foliage, are iconic symbols of the Georgia landscape."},
            {"id": "fact4", "Georgia's diverse geography, including mountains, piedmont, and coastal plains, provides a variety of microclimates suitable for growing a wide range of plants."},
            {"id": "fact5", "Georgia's native flowers, such as azaleas, dogwoods, and magnolias, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Azaleas, with their vibrant flowers in shades of pink, red, and white, are a beloved springtime sight in Georgia's gardens and landscapes."},
            {"id": "fact7", "Dogwoods, with their delicate flowers and graceful form, are native understory trees that thrive in Georgia's woodlands and gardens."},
            {"id": "fact8", "Magnolias, with their large, fragrant flowers and glossy leaves, are iconic symbols of the South and are prized for their beauty and resilience."},
            {"id": "fact9", "Hydrangeas, with their large, showy flowers in shades of blue, pink, and white, are popular ornamental shrubs in Georgia's gardens and landscapes."},
            {"id": "fact10", "Camellias, with their waxy flowers in shades of red, pink, and white, are prized for their beauty and are often called the 'rose of winter'."},
            {"id": "fact11", "Georgia's gardeners often face challenges such as pests, diseases, and extreme weather events like hurricanes and droughts."},
            {"id": "fact12", "Gardening in Georgia requires careful attention to soil quality and moisture levels, with many gardeners amending their soil with organic matter to improve fertility and structure."},
            {"id": "fact13", "Georgia's mild winters and long growing season allow for year-round gardening activities, with cool-season crops like lettuce and kale thriving in the winter months."},
            {"id": "fact14", "Georgia's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact15", "Georgia's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, African, and European gardening practices."},
            {"id": "fact16", "Georgia gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact17", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and organic gardening, helps protect Georgia's natural resources and promote environmental stewardship."},
            {"id": "fact18", "Georgia's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact19", "The state's annual garden festivals, plant sales, and garden tours bring together enthusiasts from across the state and beyond, fostering a sense of community and camaraderie among participants."},
            {"id": "fact20", "Georgia's gardening community is known for its hospitality and generosity, with gardeners sharing seeds, plants, and knowledge to help newcomers succeed in their gardening endeavors."}
        ]
    },
    {
        "state": "HAWAII",
        "commonName": "Hawaiian Hibiscus",
        "scientificName": "Hibiscus brackenridgei",
        "image": "hawaii_state_flower.jpg",
        "stateFlower": "Hawaiian Hibiscus",
        "statePlant": "Kukui",
        "stateTree": "Kukui",
        "stateCrop": ["Pineapple", "Macadamia Nuts", "Coffee", "Bananas", "Sugar Cane"],
        "commonFlowers": ["Plumeria", "Bird of Paradise", "Orchid", "Ginger", "Anthurium"],
        "gardeningFacts": [
            {"id": "fact1", "Hawaii's tropical climate and volcanic soils support a rich diversity of plants, making it a paradise for gardeners and plant enthusiasts."},
            {"id": "fact2", "Hawaiian hibiscus, the state flower, comes in a variety of colors and is prized for its large, showy flowers."},
            {"id": "fact3", "Kukui, also known as the candlenut tree, is native to Hawaii and is valued for its oily seeds, which were traditionally used for lighting torches and making leis."},
            {"id": "fact4", "Hawaii's fertile volcanic soils and abundant rainfall provide ideal growing conditions for a variety of crops, including pineapple, macadamia nuts, and coffee."},
            {"id": "fact5", "Hawaii's native flowers, such as plumeria, bird of paradise, and orchids, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Plumerias, with their fragrant flowers in shades of white, pink, and yellow, are commonly used in leis and are a beloved symbol of Hawaiian culture."},
            {"id": "fact7", "Bird of paradise, with its exotic flowers resembling a bird in flight, is a striking addition to Hawaii's gardens and landscapes."},
            {"id": "fact8", "Orchids, with their intricate flowers and long-lasting blooms, are prized for their beauty and are often used in floral arrangements and lei-making."},
            {"id": "fact9", "Ginger, with its aromatic flowers and spicy rhizomes, is a popular ornamental and culinary plant in Hawaii."},
            {"id": "fact10", "Anthuriums, with their glossy leaves and heart-shaped flowers, are often called the 'heart of Hawaii' and are a favorite among flower enthusiasts."},
            {"id": "fact11", "Hawaii's gardeners often face challenges such as pests, diseases, and invasive species that can threaten native plants and ecosystems."},
            {"id": "fact12", "Gardening in Hawaii requires careful attention to water management, with many gardeners using drip irrigation and rainwater harvesting to conserve water."},
            {"id": "fact13", "Hawaii's year-round growing season allows for continuous planting and harvesting of crops, with many gardeners growing fruits and vegetables for both personal use and sale."},
            {"id": "fact14", "Hawaii's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil fertility, pest management, and crop rotation."},
            {"id": "fact15", "Hawaii's rich cultural heritage is reflected in its gardening traditions, with influences from Native Hawaiian, Asian, and European gardening practices."},
            {"id": "fact16", "Hawaii's diverse landscapes, including lush rainforests, tropical beaches, and volcanic craters, offer endless inspiration for gardeners and nature lovers."},
            {"id": "fact17", "The state's commitment to sustainable gardening practices, such as organic farming, permaculture, and native plant landscaping, helps protect Hawaii's fragile ecosystems and promote environmental stewardship."},
            {"id": "fact18", "Hawaii's botanical gardens and arboretums showcase the state's unique plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact19", "The state's annual garden festivals, plant sales, and horticultural events celebrate Hawaii's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact20", "Hawaii's gardening community is known for its spirit of aloha, with gardeners coming together to share knowledge, exchange plants, and celebrate the beauty of the natural world."}
        ]
    },
    {
        "state": "IDAHO",
        "commonName": "Syringa",
        "scientificName": "Syringa vulgaris",
        "image": "idaho_state_flower.jpg",
        "stateFlower": "Syringa",
        "statePlant": "Western White Pine",
        "stateTree": "Western White Pine",
        "stateCrop": ["Potatoes", "Wheat", "Barley", "Sugar Beets", "Hay"],
        "commonFlowers": ["Rose", "Tulip", "Daisy", "Lilac", "Sunflower"],
        "gardeningFacts": [
            {"id": "fact1", "Idaho's diverse climate and landscapes offer a range of gardening opportunities, from high desert gardens to mountain landscapes."},
            {"id": "fact2", "Syringas, also known as lilacs, are the state flower of Idaho and are prized for their fragrant flowers in shades of purple, pink, and white."},
            {"id": "fact3", "Western white pines, the state tree, are native to Idaho and are valued for their tall, straight trunks and soft, blue-green needles."},
            {"id": "fact4", "Idaho's fertile soils and abundant water supply support a thriving agricultural industry, with potatoes, wheat, and barley being major crops."},
            {"id": "fact5", "Idaho's native flowers, such as roses, tulips, and daisies, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Roses, with their classic beauty and sweet fragrance, are a favorite among Idaho gardeners for their versatility and abundance of varieties."},
            {"id": "fact7", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Idaho's gardens and landscapes."},
            {"id": "fact8", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact9", "Lilacs, with their fragrant flowers and graceful form, are a beloved symbol of spring in Idaho and are often used in landscaping and floral arrangements."},
            {"id": "fact10", "Sunflowers, with their large, sunny blooms and edible seeds, are a cheerful addition to Idaho gardens and landscapes."},
            {"id": "fact11", "Idaho's gardeners often face challenges such as drought, extreme temperatures, and pests like aphids and deer."},
            {"id": "fact12", "Gardening in Idaho requires careful planning and timing, with many gardeners using season extenders like row covers and greenhouses to protect crops from frost."},
            {"id": "fact13", "Idaho's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil fertility, pest management, and crop rotation."},
            {"id": "fact14", "Idaho's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and pioneer gardening practices."},
            {"id": "fact15", "Idaho gardeners often use raised beds, container gardening, and companion planting techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as water conservation, organic gardening, and native plant landscaping, helps protect Idaho's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Idaho's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events bring together gardening enthusiasts from across the state to learn, share, and celebrate their love of plants."},
            {"id": "fact19", "Idaho's wild landscapes, including national parks, forests, and wilderness areas, offer endless opportunities for outdoor recreation and exploration, inspiring gardeners with their natural beauty."},
            {"id": "fact20", "Idaho's gardening community is known for its resilience and ingenuity, with gardeners finding creative solutions to overcome the challenges of gardening in a semi-arid climate and at high altitudes."}
        ]
    },
    {
        "state": "ILLINOIS",
        "commonName": "Violet",
        "scientificName": "Viola sororia",
        "image": "illinois_state_flower.jpg",
        "stateFlower": "Violet",
        "statePlant": "Native Oak",
        "stateTree": "White Oak",
        "stateCrop": ["Soybeans", "Corn", "Wheat", "Hay", "Pumpkins"],
        "commonFlowers": ["Rose", "Daisy", "Tulip", "Sunflower", "Black-eyed Susan"],
        "gardeningFacts": [
            {"id": "fact1", "Illinois' temperate climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Violets, the state flower, are native to Illinois and are valued for their delicate flowers and heart-shaped leaves."},
            {"id": "fact3", "Native oaks, including white oak, are common in Illinois' woodlands and provide habitat for wildlife as well as shade and beauty to landscapes."},
            {"id": "fact4", "Illinois' flat terrain and abundant waterways make it an ideal location for agriculture, with soybeans, corn, and wheat being major crops."},
            {"id": "fact5", "Illinois' native flowers, such as roses, daisies, and tulips, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Roses, with their classic beauty and sweet fragrance, are a favorite among Illinois gardeners for their versatility and abundance of varieties."},
            {"id": "fact7", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact8", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Illinois' gardens and landscapes."},
            {"id": "fact9", "Sunflowers, with their large, sunny blooms and edible seeds, are a cheerful addition to Illinois gardens and landscapes."},
            {"id": "fact10", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Illinois' prairies and meadows."},
            {"id": "fact11", "Illinois' gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and floods."},
            {"id": "fact12", "Gardening in Illinois requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Illinois' agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Illinois' rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Illinois gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect Illinois' natural resources and promote environmental stewardship."},
            {"id": "fact17", "Illinois' botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events bring together gardening enthusiasts from across the state to learn, share, and celebrate their love of plants."},
            {"id": "fact19", "Illinois' historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Illinois' gardening community is known for its passion and dedication, with gardeners of all ages and backgrounds coming together to share their love of plants and gardening."}
        ]
    },
    {
        "state": "INDIANA",
        "commonName": "Peony",
        "scientificName": "Paeonia",
        "image": "indiana_state_flower.jpg",
        "stateFlower": "Peony",
        "statePlant": "Tulip Tree",
        "stateTree": "Tulip Tree",
        "stateCrop": ["Corn", "Soybeans", "Wheat", "Hay", "Tomatoes"],
        "commonFlowers": ["Rose", "Tulip", "Daisy", "Sunflower", "Black-eyed Susan"],
        "gardeningFacts": [
            {"id": "fact1", "Indiana's diverse climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Peonies, the state flower, are prized for their large, showy flowers and sweet fragrance, making them a favorite among gardeners."},
            {"id": "fact3", "Tulip trees, also known as yellow poplars, are native to Indiana and are valued for their tall, straight trunks and tulip-shaped flowers."},
            {"id": "fact4", "Indiana's flat terrain and abundant waterways make it an ideal location for agriculture, with corn, soybeans, and wheat being major crops."},
            {"id": "fact5", "Indiana's native flowers, such as roses, tulips, and daisies, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Roses, with their classic beauty and sweet fragrance, are a favorite among Indiana gardeners for their versatility and abundance of varieties."},
            {"id": "fact7", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Indiana's gardens and landscapes."},
            {"id": "fact8", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact9", "Sunflowers, with their large, sunny blooms and edible seeds, are a cheerful addition to Indiana gardens and landscapes."},
            {"id": "fact10", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Indiana's prairies and meadows."},
            {"id": "fact11", "Indiana's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and floods."},
            {"id": "fact12", "Gardening in Indiana requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Indiana's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Indiana's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Indiana gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect Indiana's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Indiana's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events bring together gardening enthusiasts from across the state to learn, share, and celebrate their love of plants."},
            {"id": "fact19", "Indiana's historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Indiana's gardening community is known for its passion and dedication, with gardeners of all ages and backgrounds coming together to share their love of plants and gardening."}
        ]
    },
    {
        "state": "IOWA",
        "commonName": "Wild Prairie Rose",
        "scientificName": "Rosa arkansana",
        "image": "iowa_state_flower.jpg",
        "stateFlower": "Wild Prairie Rose",
        "statePlant": "Oak",
        "stateTree": "Oak",
        "stateCrop": ["Corn", "Soybeans", "Hay", "Wheat", "Oats"],
        "commonFlowers": ["Daisy", "Black-eyed Susan", "Tulip", "Lily", "Sunflower"],
        "gardeningFacts": [
            {"id": "fact1", "Iowa's temperate climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Wild prairie roses, the state flower, are native to Iowa and are valued for their delicate pink flowers and sweet fragrance."},
            {"id": "fact3", "Oak trees are common in Iowa's woodlands and provide habitat for wildlife as well as shade and beauty to landscapes."},
            {"id": "fact4", "Iowa's flat terrain and abundant waterways make it an ideal location for agriculture, with corn, soybeans, and hay being major crops."},
            {"id": "fact5", "Iowa's native flowers, such as daisies, black-eyed Susans, and tulips, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact7", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Iowa's prairies and meadows."},
            {"id": "fact8", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Iowa's gardens and landscapes."},
            {"id": "fact9", "Lilies, with their showy flowers and tall stalks, are a striking addition to Iowa gardens and landscapes."},
            {"id": "fact10", "Sunflowers, with their large, sunny blooms and edible seeds, are a cheerful addition to Iowa gardens and landscapes."},
            {"id": "fact11", "Iowa's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and floods."},
            {"id": "fact12", "Gardening in Iowa requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Iowa's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Iowa's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Iowa gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect Iowa's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Iowa's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events bring together gardening enthusiasts from across the state to learn, share, and celebrate their love of plants."},
            {"id": "fact19", "Iowa's historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Iowa's gardening community is known for its passion and dedication, with gardeners of all ages and backgrounds coming together to share their love of plants and gardening."}
        ]
    },
    {
        "state": "KANSAS",
        "commonName": "Sunflower",
        "scientificName": "Helianthus annuus",
        "image": "kansas_state_flower.jpg",
        "stateFlower": "Sunflower",
        "statePlant": "Plains Cottonwood",
        "stateTree": "Plains Cottonwood",
        "stateCrop": ["Wheat", "Sorghum", "Soybeans", "Corn", "Hay"],
        "commonFlowers": ["Black-eyed Susan", "Purple Coneflower", "Blanket Flower", "Daylily", "Coreopsis"],
        "gardeningFacts": [
            {"id": "fact1", "Kansas' continental climate and rich soils support a diverse range of gardening activities, from vegetable gardening to prairie restoration."},
            {"id": "fact2", "Sunflowers, the state flower, are native to Kansas and are prized for their cheerful appearance and edible seeds."},
            {"id": "fact3", "Plains cottonwood trees, with their tall stature and spreading branches, are common along rivers and streams in Kansas."},
            {"id": "fact4", "Kansas is known as the 'Wheat State' due to its extensive wheat production, which contributes significantly to the state's agricultural economy."},
            {"id": "fact5", "Kansas' native flowers, such as black-eyed Susans, purple coneflowers, and blanket flowers, are popular choices for gardeners seeking to create naturalistic landscapes."},
            {"id": "fact6", "Black-eyed Susans, with their daisy-like flowers and black centers, are common wildflowers that thrive in Kansas' prairies and meadows."},
            {"id": "fact7", "Purple coneflowers, with their striking purple petals and raised central cones, are a favorite among Kansas gardeners and pollinators alike."},
            {"id": "fact8", "Blanket flowers, with their bright colors and daisy-like blooms, are drought-tolerant perennials that add color to Kansas' landscapes."},
            {"id": "fact9", "Daylilies, with their vibrant flowers and easy care requirements, are popular perennials in Kansas gardens and landscapes."},
            {"id": "fact10", "Coreopsis, with its cheerful yellow flowers and airy foliage, is a hardy perennial that thrives in Kansas' sunny conditions."},
            {"id": "fact11", "Kansas' gardeners often face challenges such as drought, extreme temperatures, and strong winds that can damage plants and landscapes."},
            {"id": "fact12", "Gardening in Kansas requires careful planning and water management, with many gardeners using mulch and drip irrigation to conserve moisture."},
            {"id": "fact13", "Kansas' agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Kansas' rich agricultural heritage is reflected in its gardening traditions, with influences from Native American, European, and pioneer gardening practices."},
            {"id": "fact15", "Kansas gardeners often use raised beds, container gardening, and xeriscaping techniques to conserve water and maximize productivity in dry conditions."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, composting, and rainwater harvesting, helps conserve Kansas' natural resources and promote environmental stewardship."},
            {"id": "fact17", "Kansas' botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Kansas' gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Kansas' prairie landscapes, including tallgrass prairies, mixed-grass prairies, and wetlands, offer inspiration and habitat for gardeners and wildlife alike."},
            {"id": "fact20", "Kansas' gardening community is known for its resilience and ingenuity, with gardeners adapting to the challenges of the climate and landscape to create beautiful and productive gardens."}
        ]
    },
    {
        "state": "KENTUCKY",
        "commonName": "Goldenrod",
        "scientificName": "Solidago gigantea",
        "image": "kentucky_state_flower.jpg",
        "stateFlower": "Goldenrod",
        "statePlant": "Tulip Poplar",
        "stateTree": "Tulip Poplar",
        "stateCrop": ["Tobacco", "Soybeans", "Corn", "Wheat", "Hay"],
        "commonFlowers": ["Black-eyed Susan", "Purple Coneflower", "Phlox", "Butterfly Weed", "Coreopsis"],
        "gardeningFacts": [
            {"id": "fact1", "Kentucky's temperate climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Goldenrod, the state flower, is a hardy perennial known for its bright yellow flowers and ability to thrive in a variety of soil conditions."},
            {"id": "fact3", "Tulip poplar trees, also known as yellow poplars, are native to Kentucky and are valued for their straight trunks and tulip-shaped flowers."},
            {"id": "fact4", "Kentucky is known for its tobacco production, with the state's unique climate and soils providing ideal conditions for growing tobacco plants."},
            {"id": "fact5", "Kentucky's native flowers, such as black-eyed Susans, purple coneflowers, and phlox, are popular choices for gardeners seeking to attract pollinators and add color to their landscapes."},
            {"id": "fact6", "Black-eyed Susans, with their daisy-like flowers and black centers, are common wildflowers that thrive in Kentucky's meadows and roadsides."},
            {"id": "fact7", "Purple coneflowers, with their striking purple petals and raised central cones, are a favorite among Kentucky gardeners and pollinators alike."},
            {"id": "fact8", "Phlox, with its fragrant flowers and long bloom period, is a versatile perennial that adds color and fragrance to Kentucky gardens and landscapes."},
            {"id": "fact9", "Butterfly weed, with its vibrant orange flowers and ability to attract butterflies, is a popular choice for butterfly gardens and native plantings in Kentucky."},
            {"id": "fact10", "Coreopsis, with its cheerful yellow flowers and airy foliage, is a hardy perennial that thrives in Kentucky's sunny conditions."},
            {"id": "fact11", "Kentucky's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and floods."},
            {"id": "fact12", "Gardening in Kentucky requires careful planning and soil management, with many gardeners amending soil with organic matter to improve fertility and drainage."},
            {"id": "fact13", "Kentucky's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Kentucky's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Kentucky gardeners often use raised beds, container gardening, and companion planting techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as water conservation, organic gardening, and native plant landscaping, helps protect Kentucky's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Kentucky's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Kentucky's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Kentucky's rolling hills, limestone bluffs, and scenic rivers offer inspiration and habitat for gardeners and wildlife alike."},
            {"id": "fact20", "Kentucky's gardening community is known for its generosity and camaraderie, with gardeners sharing plants, knowledge, and friendship to create beautiful and thriving gardens."}
        ]
    },
    {
        "state": "LOUISIANA",
        "commonName": "Magnolia",
        "scientificName": "Magnolia grandiflora",
        "image": "louisiana_state_flower.jpg",
        "stateFlower": "Magnolia",
        "statePlant": "Bald Cypress",
        "stateTree": "Bald Cypress",
        "stateCrop": ["Sugarcane", "Rice", "Cotton", "Soybeans", "Corn"],
        "commonFlowers": ["Azalea", "Camellia", "Hydrangea", "Lantana", "Bougainvillea"],
        "gardeningFacts": [
            {"id": "fact1", "Louisiana's subtropical climate and rich soils support a wide range of gardening activities, from tropical gardening to ornamental landscaping."},
            {"id": "fact2", "Magnolias, the state flower, are beloved for their large, fragrant flowers and glossy green leaves, making them a symbol of the South."},
            {"id": "fact3", "Bald cypress trees, with their unique buttressed trunks and feathery foliage, are native to Louisiana's swamps and wetlands."},
            {"id": "fact4", "Louisiana is known for its sugarcane production, with the state's warm climate and fertile soils providing ideal conditions for growing sugarcane."},
            {"id": "fact5", "Louisiana's native flowers, such as azaleas, camellias, and hydrangeas, are popular choices for gardeners seeking to add color and beauty to their landscapes."},
            {"id": "fact6", "Azaleas, with their vibrant flowers and evergreen foliage, are a favorite among Louisiana gardeners for their showy spring displays."},
            {"id": "fact7", "Camellias, with their elegant flowers and glossy leaves, are prized for their beauty and resilience in Louisiana's hot and humid climate."},
            {"id": "fact8", "Hydrangeas, with their large, colorful blooms and lush foliage, are a popular choice for shady spots and moist soils in Louisiana gardens."},
            {"id": "fact9", "Lantanas, with their cheerful flowers and long bloom period, are drought-tolerant perennials that attract butterflies and hummingbirds to the garden."},
            {"id": "fact10", "Bougainvilleas, with their vibrant bracts and cascading growth habit, are tropical vines that thrive in Louisiana's warm climate."},
            {"id": "fact11", "Louisiana's gardeners often face challenges such as heat, humidity, and pests like aphids and fungal diseases."},
            {"id": "fact12", "Gardening in Louisiana requires careful planning and water management, with many gardeners using mulch and drip irrigation to conserve moisture."},
            {"id": "fact13", "Louisiana's agricultural extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Louisiana's rich cultural heritage is reflected in its gardening traditions, with influences from French, Spanish, African, and Native American gardening practices."},
            {"id": "fact15", "Louisiana gardeners often use raised beds, container gardening, and tropical landscaping techniques to create lush and colorful gardens."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as rainwater harvesting, composting, and organic gardening, helps protect Louisiana's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Louisiana's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Louisiana's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Louisiana's wetlands, bayous, and barrier islands offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's coastal environment."},
            {"id": "fact20", "Louisiana's gardening community is known for its hospitality and generosity, with gardeners sharing plants, knowledge, and traditions to create vibrant and welcoming gardens."}
        ]
    },
    {
        "state": "MAINE",
        "commonName": "White Pine Cone and Tassel",
        "scientificName": "Pinus strobus",
        "image": "maine_state_flower.jpg",
        "stateFlower": "White Pine Cone and Tassel",
        "statePlant": "Eastern White Pine",
        "stateTree": "Eastern White Pine",
        "stateCrop": ["Potatoes", "Blueberries", "Apples", "Corn", "Hay"],
        "commonFlowers": ["Lupine", "Beach Rose", "Black-eyed Susan", "Aster", "Goldenrod"],
        "gardeningFacts": [
            {"id": "fact1", "Maine's northern climate and rocky soils present unique challenges for gardeners, with short growing seasons and cold temperatures."},
            {"id": "fact2", "White pine cone and tassel, the state flower, is a symbol of Maine's forest heritage and is prized for its beauty and resilience."},
            {"id": "fact3", "Eastern white pine trees, with their graceful form and soft needles, are native to Maine's forests and provide habitat for wildlife as well as shade and beauty to landscapes."},
            {"id": "fact4", "Maine is known for its potato production, with the state's cool climate and fertile soils providing ideal conditions for growing potatoes."},
            {"id": "fact5", "Maine's native flowers, such as lupines, beach roses, and black-eyed Susans, are popular choices for gardeners seeking to create naturalistic landscapes."},
            {"id": "fact6", "Lupines, with their tall spikes of colorful flowers, are a common sight along Maine's roadsides and in meadows."},
            {"id": "fact7", "Beach roses, with their fragrant flowers and salt-tolerant foliage, are a favorite for coastal gardens and landscapes in Maine."},
            {"id": "fact8", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Maine's meadows and fields."},
            {"id": "fact9", "Asters, with their daisy-like flowers and profuse blooms, are a late-season favorite for Maine gardeners and pollinators alike."},
            {"id": "fact10", "Goldenrod, with its bright yellow flowers and sturdy stems, is a common sight in Maine's fields and roadsides."},
            {"id": "fact11", "Maine's gardeners often face challenges such as deer browsing, harsh winters, and rocky soils that require amendment and improvement."},
            {"id": "fact12", "Gardening in Maine requires careful planning and selection of cold-hardy plants, with many gardeners using season extenders like cold frames and row covers to prolong the growing season."},
            {"id": "fact13", "Maine's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Maine's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Maine gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect Maine's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Maine's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Maine's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Maine's rugged coastline, pristine lakes, and towering mountains offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse habitats."},
            {"id": "fact20", "Maine's gardening community is known for its resilience and resourcefulness, with gardeners adapting to the challenges of the climate and terrain to create beautiful and productive gardens."}
        ]
    },
    {
        "state": "MARYLAND",
        "commonName": "Black-eyed Susan",
        "scientificName": "Rudbeckia hirta",
        "image": "maryland_state_flower.jpg",
        "stateFlower": "Black-eyed Susan",
        "statePlant": "White Oak",
        "stateTree": "White Oak",
        "stateCrop": ["Corn", "Soybeans", "Wheat", "Apples", "Tomatoes"],
        "commonFlowers": ["Rose", "Daisy", "Lily", "Tulip", "Hydrangea"],
        "gardeningFacts": [
            {"id": "fact1", "Maryland's diverse climate and varied landscapes offer opportunities for a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Black-eyed Susans, the state flower, are native wildflowers that thrive in Maryland's meadows, fields, and gardens."},
            {"id": "fact3", "White oak trees, with their massive size and distinctive lobed leaves, are iconic symbols of Maryland's forests and landscapes."},
            {"id": "fact4", "Corn, soybeans, and wheat are major crops in Maryland, with the state's fertile soils and moderate climate supporting agriculture."},
            {"id": "fact5", "Maryland's gardeners often cultivate a variety of flowers, such as roses, daisies, lilies, tulips, and hydrangeas, to add color and beauty to their landscapes."},
            {"id": "fact6", "Roses, with their classic beauty and sweet fragrance, are a favorite among Maryland gardeners for their versatility and abundance of varieties."},
            {"id": "fact7", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact8", "Lilies, with their showy flowers and tall stalks, are a striking addition to Maryland gardens and landscapes."},
            {"id": "fact9", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Maryland's gardens and landscapes."},
            {"id": "fact10", "Hydrangeas, with their large, colorful blooms and lush foliage, are popular shrubs for borders, hedges, and containers in Maryland."},
            {"id": "fact11", "Maryland's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and storms."},
            {"id": "fact12", "Gardening in Maryland requires careful planning and soil management, with many gardeners amending soil with organic matter to improve fertility and structure."},
            {"id": "fact13", "Maryland's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "Maryland's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Maryland gardeners often use raised beds, container gardening, and companion planting techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as water conservation, organic gardening, and native plant landscaping, helps protect Maryland's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Maryland's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Maryland's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Maryland's historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Maryland's gardening community is known for its creativity and innovation, with gardeners experimenting with new techniques, plants, and designs to create beautiful and sustainable gardens."}
        ]
    },
    {
        "state": "MASSACHUSETTS",
        "commonName": "Mayflower",
        "scientificName": "Epigaea repens",
        "image": "massachusetts_state_flower.jpg",
        "stateFlower": "Mayflower",
        "statePlant": "American Elm",
        "stateTree": "American Elm",
        "stateCrop": ["Cranberries", "Apples", "Hay", "Vegetables", "Nursery stock"],
        "commonFlowers": ["Rhododendron", "Lily", "Daisy", "Tulip", "Hyacinth"],
        "gardeningFacts": [
            {"id": "fact1", "Massachusetts' diverse climate and varied landscapes offer opportunities for a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Mayflowers, the state flower, are delicate wildflowers that bloom in early spring and are often found in Massachusetts' woodlands and forests."},
            {"id": "fact3", "American elm trees, with their tall stature and arching branches, are native to Massachusetts and are valued for their shade and beauty."},
            {"id": "fact4", "Cranberries are an important crop in Massachusetts, with the state's sandy, acidic soils and cool climate providing ideal conditions for growing cranberries."},
            {"id": "fact5", "Massachusetts' gardeners often cultivate a variety of flowers, such as rhododendrons, lilies, daisies, tulips, and hyacinths, to add color and beauty to their landscapes."},
            {"id": "fact6", "Rhododendrons, with their large, showy flowers and evergreen foliage, are a favorite among Massachusetts gardeners for their year-round interest."},
            {"id": "fact7", "Lilies, with their graceful flowers and elegant blooms, are a popular choice for borders, containers, and cut flower arrangements in Massachusetts."},
            {"id": "fact8", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact9", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Massachusetts' gardens and landscapes."},
            {"id": "fact10", "Hyacinths, with their fragrant flowers and compact growth habit, are a favorite for early spring color in Massachusetts."},
            {"id": "fact11", "Massachusetts' gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and storms."},
            {"id": "fact12", "Gardening in Massachusetts requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Massachusetts' cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "Massachusetts' rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Massachusetts gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect Massachusetts' natural resources and promote environmental stewardship."},
            {"id": "fact17", "Massachusetts' botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Massachusetts' gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Massachusetts' historic gardens and landscapes, including formal gardens, estates, and public parks, offer inspiration and insight into the state's gardening heritage."},
            {"id": "fact20", "Massachusetts' gardening community is known for its creativity and resilience, with gardeners adapting to the challenges of the climate and terrain to create beautiful and productive gardens."}
        ]
    },
    {
        "state": "MICHIGAN",
        "commonName": "Apple Blossom",
        "scientificName": "Malus domestica",
        "image": "michigan_state_flower.jpg",
        "stateFlower": "Apple Blossom",
        "statePlant": "White Pine",
        "stateTree": "White Pine",
        "stateCrop": ["Apples", "Blueberries", "Cherries", "Corn", "Soybeans"],
        "commonFlowers": ["Tulip", "Daisy", "Hydrangea", "Black-eyed Susan", "Lily of the Valley"],
        "gardeningFacts": [
            {"id": "fact1", "Michigan's diverse climate and fertile soils support a wide range of gardening activities, from fruit growing to ornamental landscaping."},
            {"id": "fact2", "Apple blossoms, the state flower, herald the arrival of spring in Michigan and are a symbol of the state's apple-growing industry."},
            {"id": "fact3", "White pine trees, with their tall stature and slender needles, are native to Michigan's forests and provide habitat for wildlife as well as shade and beauty to landscapes."},
            {"id": "fact4", "Apples, cherries, and blueberries are major crops in Michigan, with the state's moderate climate and well-drained soils providing ideal conditions for fruit production."},
            {"id": "fact5", "Michigan's gardeners often cultivate a variety of flowers, such as tulips, daisies, hydrangeas, black-eyed Susans, and lilies of the valley, to add color and beauty to their landscapes."},
            {"id": "fact6", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Michigan's gardens and landscapes."},
            {"id": "fact7", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact8", "Hydrangeas, with their large, colorful blooms and lush foliage, are popular shrubs for borders, hedges, and containers in Michigan."},
            {"id": "fact9", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Michigan's meadows and fields."},
            {"id": "fact10", "Lilies of the valley, with their delicate bell-shaped flowers and sweet fragrance, are a favorite for shady spots and woodland gardens in Michigan."},
            {"id": "fact11", "Michigan's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and storms."},
            {"id": "fact12", "Gardening in Michigan requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Michigan's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "Michigan's rich agricultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Michigan gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect Michigan's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Michigan's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Michigan's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Michigan's scenic lakeshores, rolling hills, and expansive forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse habitats."},
            {"id": "fact20", "Michigan's gardening community is known for its passion and resilience, with gardeners overcoming challenges to create beautiful and productive gardens that contribute to the state's agricultural heritage."}
        ]
    },
    {
        "state": "MINNESOTA",
        "commonName": "Pink and White Lady's Slipper",
        "scientificName": "Cypripedium reginae",
        "image": "minnesota_state_flower.jpg",
        "stateFlower": "Pink and White Lady's Slipper",
        "statePlant": "Norway Pine",
        "stateTree": "Norway Pine",
        "stateCrop": ["Corn", "Soybeans", "Wheat", "Sugar Beets", "Hay"],
        "commonFlowers": ["Lilac", "Tulip", "Daisy", "Hosta", "Daylily"],
        "gardeningFacts": [
            {"id": "fact1", "Minnesota's diverse climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Pink and white lady's slippers, the state flower, are native wildflowers that bloom in Minnesota's woodlands and forests."},
            {"id": "fact3", "Norway pine trees, with their tall stature and reddish-brown bark, are native to Minnesota's forests and provide habitat for wildlife as well as shade and beauty to landscapes."},
            {"id": "fact4", "Corn, soybeans, and wheat are major crops in Minnesota, with the state's fertile soils and moderate climate supporting agriculture."},
            {"id": "fact5", "Minnesota's gardeners often cultivate a variety of flowers, such as lilacs, tulips, daisies, hostas, and daylilies, to add color and beauty to their landscapes."},
            {"id": "fact6", "Lilacs, with their fragrant flowers and graceful habit, are a favorite among Minnesota gardeners for their beauty and resilience."},
            {"id": "fact7", "Tulips, with their bold colors and elegant blooms, are a beloved spring flower in Minnesota's gardens and landscapes."},
            {"id": "fact8", "Daisies, with their cheerful flowers and long-lasting blooms, are easy to grow and attract pollinators to the garden."},
            {"id": "fact9", "Hostas, with their attractive foliage and tolerance for shade, are popular perennials for borders, beds, and containers in Minnesota."},
            {"id": "fact10", "Daylilies, with their vibrant flowers and easy-care nature, are a favorite for Minnesota gardeners seeking low-maintenance beauty."},
            {"id": "fact11", "Minnesota's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and storms."},
            {"id": "fact12", "Gardening in Minnesota requires careful planning and timing, with many gardeners starting seeds indoors and transplanting seedlings outdoors after the last frost date."},
            {"id": "fact13", "Minnesota's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "Minnesota's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Minnesota gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect Minnesota's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Minnesota's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Minnesota's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Minnesota's lakes, rivers, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Minnesota's gardening community is known for its resilience and resourcefulness, with gardeners adapting to the challenges of the climate and terrain to create beautiful and productive gardens that contribute to the state's agricultural heritage."}
        ]
    },
    {
        "state": "MISSISSIPPI",
        "commonName": "Magnolia",
        "scientificName": "Magnolia grandiflora",
        "image": "mississippi_state_flower.jpg",
        "stateFlower": "Magnolia",
        "statePlant": "Southern Magnolia",
        "stateTree": "Southern Magnolia",
        "stateCrop": ["Cotton", "Soybeans", "Corn", "Rice", "Sweet Potatoes"],
        "commonFlowers": ["Azalea", "Coreopsis", "Black-eyed Susan", "Hydrangea", "Rose"],
        "gardeningFacts": [
            {"id": "fact1", "Mississippi's subtropical climate and rich soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Magnolias, the state flower, are beloved for their large, fragrant flowers and glossy green leaves, making them a symbol of the South."},
            {"id": "fact3", "Southern magnolias, with their showy flowers and evergreen foliage, are native to Mississippi's forests and landscapes."},
            {"id": "fact4", "Cotton, soybeans, and corn are major crops in Mississippi, with the state's warm climate and fertile soils providing ideal conditions for agriculture."},
            {"id": "fact5", "Mississippi's gardeners often cultivate a variety of flowers, such as azaleas, coreopsis, black-eyed Susans, hydrangeas, and roses, to add color and beauty to their landscapes."},
            {"id": "fact6", "Azaleas, with their vibrant flowers and evergreen foliage, are a favorite among Mississippi gardeners for their showy spring displays."},
            {"id": "fact7", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in Mississippi gardens."},
            {"id": "fact8", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Mississippi's meadows and fields."},
            {"id": "fact9", "Hydrangeas, with their large, colorful blooms and lush foliage, are popular shrubs for borders, hedges, and containers in Mississippi."},
            {"id": "fact10", "Roses, with their classic beauty and sweet fragrance, are a favorite among Mississippi gardeners for their versatility and abundance of varieties."},
            {"id": "fact11", "Mississippi's gardeners often face challenges such as heat, humidity, and pests like aphids and fungal diseases."},
            {"id": "fact12", "Gardening in Mississippi requires careful planning and water management, with many gardeners using mulch and drip irrigation to conserve moisture."},
            {"id": "fact13", "Mississippi's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Mississippi's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and African American gardening practices."},
            {"id": "fact15", "Mississippi gardeners often use raised beds, container gardening, and companion planting techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as water conservation, organic gardening, and native plant landscaping, helps protect Mississippi's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Mississippi's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Mississippi's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Mississippi's rivers, wetlands, and coastal areas offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Mississippi's gardening community is known for its hospitality and resilience, with gardeners sharing plants, knowledge, and traditions to create vibrant and welcoming gardens."}
        ]
    },
    {
        "state": "MISSOURI",
        "commonName": "Hawthorn",
        "scientificName": "Crataegus",
        "image": "missouri_state_flower.jpg",
        "stateFlower": "Hawthorn",
        "statePlant": "Flowering Dogwood",
        "stateTree": "Flowering Dogwood",
        "stateCrop": ["Soybeans", "Corn", "Cotton", "Hay", "Wheat"],
        "commonFlowers": ["Purple Coneflower", "Black-eyed Susan", "Coreopsis", "Bee Balm", "Liatris"],
        "gardeningFacts": [
            {"id": "fact1", "Missouri's diverse climate and varied landscapes offer opportunities for a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Hawthorns, the state flower, are native trees and shrubs that produce clusters of white or pink flowers in spring and red berries in fall."},
            {"id": "fact3", "Flowering dogwoods, with their showy flowers and colorful foliage, are native trees that are prized for their beauty and resilience."},
            {"id": "fact4", "Soybeans, corn, and cotton are major crops in Missouri, with the state's fertile soils and moderate climate supporting agriculture."},
            {"id": "fact5", "Missouri's gardeners often cultivate a variety of flowers, such as purple coneflowers, black-eyed Susans, coreopsis, bee balm, and liatris, to add color and beauty to their landscapes."},
            {"id": "fact6", "Purple coneflowers, with their distinctive petals and prominent cones, are a favorite among Missouri gardeners for their drought tolerance and wildlife attraction."},
            {"id": "fact7", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Missouri's meadows and fields."},
            {"id": "fact8", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in Missouri gardens."},
            {"id": "fact9", "Bee balm, with its fragrant flowers and attractive foliage, is a favorite for attracting pollinators like bees and butterflies to the garden."},
            {"id": "fact10", "Liatris, with its tall spikes of purple flowers, is a striking addition to Missouri gardens and landscapes."},
            {"id": "fact11", "Missouri's gardeners often face challenges such as pests, diseases, and extreme weather events like droughts and storms."},
            {"id": "fact12", "Gardening in Missouri requires careful planning and soil management, with many gardeners amending soil with organic matter to improve fertility and drainage."},
            {"id": "fact13", "Missouri's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "Missouri's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Missouri gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect Missouri's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Missouri's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Missouri's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Missouri's rivers, forests, and prairies offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Missouri's gardening community is known for its creativity and innovation, with gardeners experimenting with new techniques, plants, and designs to create beautiful and sustainable gardens."}
        ]
    },
    {
        "state": "MONTANA",
        "commonName": "Bitterroot",
        "scientificName": "Lewisia rediviva",
        "image": "montana_state_flower.jpg",
        "stateFlower": "Bitterroot",
        "statePlant": "Ponderosa Pine",
        "stateTree": "Ponderosa Pine",
        "stateCrop": ["Wheat", "Barley", "Hay", "Potatoes", "Sugar Beets"],
        "commonFlowers": ["Indian Paintbrush", "Arrowleaf Balsamroot", "Prairie Crocus", "Western Blue Flag", "Yellowbells"],
        "gardeningFacts": [
            {"id": "fact1", "Montana's diverse climate and rugged landscapes present unique challenges and opportunities for gardening enthusiasts."},
            {"id": "fact2", "Bitterroots, the state flower, are small, pinkish flowers that bloom in spring and are found in dry, rocky habitats throughout Montana."},
            {"id": "fact3", "Ponderosa pines, with their tall trunks and distinctive bark, are native to Montana's forests and provide habitat for wildlife as well as shade and beauty to landscapes."},
            {"id": "fact4", "Wheat, barley, and hay are major crops in Montana, with the state's vast plains and fertile valleys supporting agriculture."},
            {"id": "fact5", "Montana's gardeners often cultivate a variety of wildflowers, such as Indian paintbrush, arrowleaf balsamroot, prairie crocus, western blue flag, and yellowbells, to add color and beauty to their landscapes."},
            {"id": "fact6", "Indian paintbrush, with its brightly colored bracts and slender stems, is a striking addition to Montana's meadows and prairies."},
            {"id": "fact7", "Arrowleaf balsamroot, with its large, yellow flowers and heart-shaped leaves, is a favorite among Montana gardeners for its drought tolerance and wildlife attraction."},
            {"id": "fact8", "Prairie crocus, with its delicate purple flowers and fuzzy foliage, is one of the first wildflowers to bloom in Montana's spring landscapes."},
            {"id": "fact9", "Western blue flag, with its showy blue flowers and sword-like leaves, thrives in Montana's wetlands and riparian areas."},
            {"id": "fact10", "Yellowbells, with their nodding, yellow flowers and slender stems, brighten up Montana's rocky slopes and hillsides in early summer."},
            {"id": "fact11", "Montana's gardeners often face challenges such as harsh winters, short growing seasons, and unpredictable weather patterns."},
            {"id": "fact12", "Gardening in Montana requires careful selection of cold-hardy plants and season extenders like cold frames and row covers to protect crops from frost and cold temperatures."},
            {"id": "fact13", "Montana's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and crop selection."},
            {"id": "fact14", "Montana's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Montana gardeners often use raised beds, container gardening, and hoop houses to extend the growing season and protect crops from wildlife and harsh weather."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as water conservation, organic gardening, and native plant landscaping, helps protect Montana's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Montana's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Montana's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Montana's vast wilderness areas, national parks, and scenic landscapes offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Montana's gardening community is known for its resilience and ingenuity, with gardeners finding creative solutions to overcome the challenges of the climate and terrain to create beautiful and productive gardens."}
        ]
    },
    {
        "state": "NEBRASKA",
        "commonName": "Goldenrod",
        "scientificName": "Solidago gigantea",
        "image": "nebraska_state_flower.jpg",
        "stateFlower": "Goldenrod",
        "statePlant": "Eastern Cottonwood",
        "stateTree": "Eastern Cottonwood",
        "stateCrop": ["Corn", "Soybeans", "Wheat", "Hay", "Sorghum"],
        "commonFlowers": ["Purple Coneflower", "Black-eyed Susan", "Blanket Flower", "Plains Coreopsis", "Prairie Clover"],
        "gardeningFacts": [
            {"id": "fact1", "Nebraska's diverse climate and fertile soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Goldenrods, the state flower, are native wildflowers that bloom in late summer and early fall, providing nectar for pollinators like bees and butterflies."},
            {"id": "fact3", "Eastern cottonwoods, with their tall stature and heart-shaped leaves, are native trees that thrive along Nebraska's rivers and waterways."},
            {"id": "fact4", "Corn, soybeans, and wheat are major crops in Nebraska, with the state's fertile soils and moderate climate supporting agriculture."},
            {"id": "fact5", "Nebraska's gardeners often cultivate a variety of wildflowers, such as purple coneflowers, black-eyed Susans, blanket flowers, plains coreopsis, and prairie clover, to add color and beauty to their landscapes."},
            {"id": "fact6", "Purple coneflowers, with their distinctive petals and prominent cones, are a favorite among Nebraska gardeners for their drought tolerance and wildlife attraction."},
            {"id": "fact7", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in Nebraska's meadows and fields."},
            {"id": "fact8", "Blanket flowers, with their vibrant colors and long-lasting blooms, are a favorite for adding color and texture to Nebraska's gardens."},
            {"id": "fact9", "Plains coreopsis, with its bright yellow flowers and delicate foliage, is a popular choice for sunny borders and meadows in Nebraska gardens."},
            {"id": "fact10", "Prairie clover, with its spiky flowers and silvery foliage, thrives in Nebraska's prairies and grasslands."},
            {"id": "fact11", "Nebraska's gardeners often face challenges such as drought, heat, and pests like grasshoppers and aphids."},
            {"id": "fact12", "Gardening in Nebraska requires careful planning and water management, with many gardeners using mulch and drip irrigation to conserve moisture."},
            {"id": "fact13", "Nebraska's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "Nebraska's rich agricultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Nebraska gardeners often use raised beds, container gardening, and hoop houses to extend the growing season and protect crops from wildlife and harsh weather."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect Nebraska's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Nebraska's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Nebraska's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Nebraska's wide-open spaces, rolling prairies, and scenic landscapes offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Nebraska's gardening community is known for its resilience and ingenuity, with gardeners finding creative solutions to overcome the challenges of the climate and terrain to create beautiful and productive gardens."}
        ]
    },
    {
        "state": "NEVADA",
        "commonName": "Sagebrush",
        "scientificName": "Artemisia tridentata",
        "image": "nevada_state_flower.jpg",
        "stateFlower": "Sagebrush",
        "statePlant": "Single-leaf Pinyon",
        "stateTree": "Single-leaf Pinyon",
        "stateCrop": ["Hay", "Alfalfa", "Barley", "Corn", "Wheat"],
        "commonFlowers": ["Desert Marigold", "Indian Paintbrush", "Desert Globemallow", "Firecracker Penstemon", "Prairie Sunflower"],
        "gardeningFacts": [
            {"id": "fact1", "Nevada's arid climate and desert landscapes present unique challenges and opportunities for gardening enthusiasts."},
            {"id": "fact2", "Sagebrush, the state flower, is a hardy shrub that is well-adapted to Nevada's dry conditions and is an important part of the state's natural landscapes."},
            {"id": "fact3", "Single-leaf pinyons, with their distinctive needles and small cones, are native trees that are well-suited to Nevada's rugged terrain."},
            {"id": "fact4", "Hay, alfalfa, and barley are major crops in Nevada, with the state's irrigated valleys and high desert plains supporting agriculture."},
            {"id": "fact5", "Nevada's gardeners often cultivate a variety of desert-adapted flowers, such as desert marigolds, Indian paintbrushes, desert globemallows, firecracker penstemons, and prairie sunflowers, to add color and beauty to their landscapes."},
            {"id": "fact6", "Desert marigolds, with their bright yellow flowers and silvery foliage, are a favorite among Nevada gardeners for their drought tolerance and heat resistance."},
            {"id": "fact7", "Indian paintbrushes, with their colorful bracts and slender stems, add a splash of red, orange, or pink to Nevada's desert landscapes."},
            {"id": "fact8", "Desert globemallows, with their showy orange flowers and velvety leaves, thrive in Nevada's sandy soils and dry conditions."},
            {"id": "fact9", "Firecracker penstemons, with their tubular red flowers and lance-shaped leaves, attract hummingbirds and butterflies to Nevada's gardens and landscapes."},
            {"id": "fact10", "Prairie sunflowers, with their bright yellow flowers and sturdy stems, add height and color to Nevada's gardens and wildflower meadows."},
            {"id": "fact11", "Nevada's gardeners often face challenges such as water scarcity, extreme temperatures, and poor soil quality."},
            {"id": "fact12", "Gardening in Nevada requires careful selection of drought-tolerant plants and water-saving techniques, such as mulching and drip irrigation."},
            {"id": "fact13", "Nevada's cooperative extension services provide valuable resources and support to gardeners, offering advice on water-wise gardening, soil improvement, and pest management."},
            {"id": "fact14", "Nevada's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Spanish, and pioneer gardening practices."},
            {"id": "fact15", "Nevada gardeners often use raised beds, container gardening, and xeriscaping techniques to conserve water and create beautiful, low-maintenance landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, composting, and rainwater harvesting, helps protect Nevada's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Nevada's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Nevada's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Nevada's scenic deserts, mountains, and valleys offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's extreme conditions."},
            {"id": "fact20", "Nevada's gardening community is known for its resilience and resourcefulness, with gardeners finding innovative solutions to create beautiful and sustainable landscapes in challenging environments."}
        ]
    },
    {
        "state": "NEW HAMPSHIRE",
        "commonName": "Purple Lilac",
        "scientificName": "Syringa vulgaris",
        "image": "new_hampshire_state_flower.jpg",
        "stateFlower": "Purple Lilac",
        "statePlant": "White Birch",
        "stateTree": "White Birch",
        "stateCrop": ["Apples", "Hay", "Maple Syrup", "Potatoes", "Pumpkins"],
        "commonFlowers": ["Rhododendron", "Black-eyed Susan", "Columbine", "Daylily", "Peony"],
        "gardeningFacts": [
            {"id": "fact1", "New Hampshire's diverse climate and scenic landscapes offer opportunities for a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Purple lilacs, the state flower, are beloved for their fragrant flowers and graceful habit, making them a symbol of spring in New Hampshire."},
            {"id": "fact3", "White birches, with their distinctive bark and delicate leaves, are native trees that are prized for their beauty and resilience."},
            {"id": "fact4", "Apples, hay, and maple syrup are major crops in New Hampshire, with the state's orchards, fields, and forests supporting agriculture."},
            {"id": "fact5", "New Hampshire's gardeners often cultivate a variety of flowers, such as rhododendrons, black-eyed Susans, columbines, daylilies, and peonies, to add color and beauty to their landscapes."},
            {"id": "fact6", "Rhododendrons, with their showy flowers and evergreen foliage, are a favorite among New Hampshire gardeners for their shade tolerance and year-round interest."},
            {"id": "fact7", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in New Hampshire's meadows and fields."},
            {"id": "fact8", "Columbines, with their delicate flowers and graceful stems, are a favorite for attracting hummingbirds and butterflies to New Hampshire's gardens."},
            {"id": "fact9", "Daylilies, with their vibrant flowers and easy-care nature, are a popular choice for borders, beds, and containers in New Hampshire."},
            {"id": "fact10", "Peonies, with their large, fragrant flowers and lush foliage, are a classic addition to New Hampshire's cottage gardens and perennial borders."},
            {"id": "fact11", "New Hampshire's gardeners often face challenges such as cold winters, deer browsing, and soil acidity."},
            {"id": "fact12", "Gardening in New Hampshire requires careful selection of cold-hardy plants and deer-resistant varieties, as well as soil amendment to adjust pH levels."},
            {"id": "fact13", "New Hampshire's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "New Hampshire's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "New Hampshire gardeners often use raised beds, container gardening, and cold frames to extend the growing season and protect crops from frost and wildlife."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic gardening, and native plant landscaping, helps protect New Hampshire's natural resources and promote environmental stewardship."},
            {"id": "fact17", "New Hampshire's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate New Hampshire's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "New Hampshire's lakes, mountains, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "New Hampshire's gardening community is known for its creativity and camaraderie, with gardeners sharing tips, plants, and experiences to create beautiful and bountiful gardens throughout the state."}
        ]
    },
    {
        "state": "NEW JERSEY",
        "commonName": "Violet",
        "scientificName": "Viola sororia",
        "image": "new_jersey_state_flower.jpg",
        "stateFlower": "Violet",
        "statePlant": "Northern Red Oak",
        "stateTree": "Northern Red Oak",
        "stateCrop": ["Cranberries", "Blueberries", "Tomatoes", "Bell Peppers", "Corn"],
        "commonFlowers": ["Black-eyed Susan", "Coreopsis", "Tickseed", "Goldenrod", "Butterfly Weed"],
        "gardeningFacts": [
            {"id": "fact1", "New Jersey's diverse climate and fertile soils support a wide variety of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Violets, the state flower, are small, delicate flowers that bloom in early spring and are found in woodlands, meadows, and gardens throughout New Jersey."},
            {"id": "fact3", "Northern red oaks, with their broad, spreading crowns and lobed leaves, are native trees that provide shade and beauty to New Jersey's landscapes."},
            {"id": "fact4", "Cranberries, blueberries, and tomatoes are major crops in New Jersey, with the state's sandy soils and moderate climate supporting agriculture."},
            {"id": "fact5", "New Jersey's gardeners often cultivate a variety of flowers, such as black-eyed Susans, coreopsis, tickseed, goldenrod, and butterfly weed, to add color and beauty to their landscapes."},
            {"id": "fact6", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in New Jersey's meadows and fields."},
            {"id": "fact7", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in New Jersey gardens."},
            {"id": "fact8", "Tickseed, with its daisy-like flowers and long bloom period, is a favorite for attracting pollinators like bees and butterflies to New Jersey's gardens."},
            {"id": "fact9", "Goldenrod, with its showy yellow flowers and upright growth habit, brightens up New Jersey's late summer and fall landscapes."},
            {"id": "fact10", "Butterfly weed, with its vibrant orange flowers and narrow leaves, is a favorite for attracting butterflies to New Jersey's gardens."},
            {"id": "fact11", "New Jersey's gardeners often face challenges such as deer browsing, poor soil drainage, and pests like deer ticks and Japanese beetles."},
            {"id": "fact12", "Gardening in New Jersey requires careful planning and pest management, with many gardeners using fencing, repellents, and integrated pest management techniques to protect their crops."},
            {"id": "fact13", "New Jersey's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest management, and plant selection."},
            {"id": "fact14", "New Jersey's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "New Jersey gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect New Jersey's natural resources and promote environmental stewardship."},
            {"id": "fact17", "New Jersey's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate New Jersey's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "New Jersey's beaches, forests, and wetlands offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "New Jersey's gardening community is known for its creativity and resilience, with gardeners finding innovative solutions to overcome challenges and create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "NEW MEXICO",
        "commonName": "Yucca Flower",
        "scientificName": "Yucca",
        "image": "new_mexico_state_flower.jpg",
        "stateFlower": "Yucca Flower",
        "statePlant": "Blue Spruce",
        "stateTree": "Blue Spruce",
        "stateCrop": ["Chile Peppers", "Pecans", "Hay", "Corn", "Wheat"],
        "commonFlowers": ["Desert Marigold", "Penstemon", "Gaillardia", "Columbine", "Apache Plume"],
        "gardeningFacts": [
            {"id": "fact1", "New Mexico's diverse climate and rugged landscapes offer unique challenges and opportunities for gardening enthusiasts."},
            {"id": "fact2", "Yucca flowers, the state flower, are iconic symbols of the Southwest and thrive in New Mexico's arid conditions, blooming in late spring and early summer."},
            {"id": "fact3", "Blue spruces, with their striking blue-green needles and conical shape, are native trees that add beauty and shade to New Mexico's landscapes."},
            {"id": "fact4", "Chile peppers, pecans, and hay are major crops in New Mexico, with the state's sunny days and cool nights supporting agriculture."},
            {"id": "fact5", "New Mexico's gardeners often cultivate a variety of flowers, such as desert marigolds, penstemons, gaillardias, columbines, and apache plumes, to add color and beauty to their landscapes."},
            {"id": "fact6", "Desert marigolds, with their bright yellow flowers and silver-gray foliage, are drought-tolerant plants that thrive in New Mexico's dry soils and hot sun."},
            {"id": "fact7", "Penstemons, with their tubular flowers and slender stems, attract hummingbirds and butterflies to New Mexico's gardens and wild spaces."},
            {"id": "fact8", "Gaillardias, with their daisy-like flowers and vibrant colors, are easy-care perennials that bloom from spring to fall in New Mexico."},
            {"id": "fact9", "Columbines, with their delicate flowers and fern-like foliage, are native wildflowers that add elegance to New Mexico's woodlands and meadows."},
            {"id": "fact10", "Apache plumes, with their feathery white flowers and reddish seed heads, are native shrubs that provide food and habitat for wildlife in New Mexico."},
            {"id": "fact11", "New Mexico's gardeners often face challenges such as drought, poor soil fertility, and extreme temperature fluctuations."},
            {"id": "fact12", "Gardening in New Mexico requires careful water management, soil amendment, and plant selection to thrive in the state's arid conditions."},
            {"id": "fact13", "New Mexico's cooperative extension services provide valuable resources and support to gardeners, offering advice on water-wise gardening, pest management, and crop selection."},
            {"id": "fact14", "New Mexico's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Spanish, and Mexican gardening practices."},
            {"id": "fact15", "New Mexico gardeners often use raised beds, container gardening, and xeriscaping techniques to conserve water and create beautiful, low-maintenance landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, rainwater harvesting, and organic gardening, helps protect New Mexico's natural resources and promote environmental stewardship."},
            {"id": "fact17", "New Mexico's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate New Mexico's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "New Mexico's deserts, mountains, and rivers offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "New Mexico's gardening community is known for its creativity and resilience, with gardeners adapting to the challenges of the desert climate to create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "NEW YORK",
        "commonName": "Rose",
        "scientificName": "Rosa",
        "image": "new_york_state_flower.jpg",
        "stateFlower": "Rose",
        "statePlant": "Sugar Maple",
        "stateTree": "Sugar Maple",
        "stateCrop": ["Apples", "Grapes", "Dairy Products", "Corn", "Hay"],
        "commonFlowers": ["Lilac", "Tulip", "Daffodil", "Hydrangea", "Peony"],
        "gardeningFacts": [
            {"id": "fact1", "New York's diverse climate and fertile soils support a wide variety of gardening activities, from fruit growing to flower gardening."},
            {"id": "fact2", "Roses, the state flower, are cherished for their beauty and fragrance, and are cultivated in gardens and parks throughout New York."},
            {"id": "fact3", "Sugar maples, with their brilliant fall foliage and sweet sap, are native trees that are valued for their timber and syrup production."},
            {"id": "fact4", "Apples, grapes, and dairy products are major agricultural products in New York, with the state's orchards, vineyards, and farms supporting agriculture."},
            {"id": "fact5", "New York's gardeners often cultivate a variety of flowers, such as lilacs, tulips, daffodils, hydrangeas, and peonies, to add color and beauty to their landscapes."},
            {"id": "fact6", "Lilacs, with their fragrant flowers and graceful habit, are a favorite among New York gardeners for their spring blooms and attractive foliage."},
            {"id": "fact7", "Tulips, with their vibrant flowers and elegant stems, are a classic addition to New York's spring gardens and flower beds."},
            {"id": "fact8", "Daffodils, with their cheerful flowers and trumpet-shaped blooms, are a welcome sight in New York's gardens and parks in early spring."},
            {"id": "fact9", "Hydrangeas, with their large, showy flowers and lush foliage, are prized for their long-lasting blooms and versatility in New York's landscapes."},
            {"id": "fact10", "Peonies, with their large, fragrant flowers and glossy foliage, are a favorite for bouquets and borders in New York gardens."},
            {"id": "fact11", "New York's gardeners often face challenges such as harsh winters, deer browsing, and urban pollution."},
            {"id": "fact12", "Gardening in New York requires careful plant selection, pest management, and soil amendment to thrive in the state's diverse environments."},
            {"id": "fact13", "New York's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest control, and plant care."},
            {"id": "fact14", "New York's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "New York gardeners often use raised beds, container gardening, and community gardens to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect New York's natural resources and promote environmental stewardship."},
            {"id": "fact17", "New York's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate New York's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "New York's parks, gardens, and historic estates offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "New York's gardening community is known for its creativity and resilience, with gardeners adapting to the challenges of the urban environment to create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "NORTH CAROLINA",
        "commonName": "Dogwood",
        "scientificName": "Cornus florida",
        "image": "north_carolina_state_flower.jpg",
        "stateFlower": "Dogwood",
        "statePlant": "Pine",
        "stateTree": "Pine",
        "stateCrop": ["Tobacco", "Sweet Potatoes", "Soybeans", "Corn", "Wheat"],
        "commonFlowers": ["Rhododendron", "Azalea", "Black-eyed Susan", "Coreopsis", "Goldenrod"],
        "gardeningFacts": [
            {"id": "fact1", "North Carolina's diverse climate and rich soils support a wide range of gardening activities, from vegetable gardening to ornamental landscaping."},
            {"id": "fact2", "Dogwoods, the state flower, are beloved for their showy blooms and elegant form, and are commonly found in parks, gardens, and woodlands throughout North Carolina."},
            {"id": "fact3", "Pines, with their tall trunks and evergreen needles, are native trees that are important for timber production and wildlife habitat in North Carolina."},
            {"id": "fact4", "Tobacco, sweet potatoes, and soybeans are major crops in North Carolina, with the state's warm climate and fertile soils supporting agriculture."},
            {"id": "fact5", "North Carolina's gardeners often cultivate a variety of flowers, such as rhododendrons, azaleas, black-eyed Susans, coreopsis, and goldenrods, to add color and beauty to their landscapes."},
            {"id": "fact6", "Rhododendrons, with their large, showy flowers and glossy leaves, are a favorite among North Carolina gardeners for their shade tolerance and year-round interest."},
            {"id": "fact7", "Azaleas, with their colorful flowers and evergreen foliage, are prized for their spring blooms and low maintenance in North Carolina's gardens."},
            {"id": "fact8", "Black-eyed Susans, with their daisy-like flowers and black centers, are native wildflowers that thrive in North Carolina's meadows and fields."},
            {"id": "fact9", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in North Carolina gardens."},
            {"id": "fact10", "Goldenrods, with their showy yellow flowers and upright growth habit, add color and texture to North Carolina's late summer and fall landscapes."},
            {"id": "fact11", "North Carolina's gardeners often face challenges such as heat, humidity, and pests like deer and rabbits."},
            {"id": "fact12", "Gardening in North Carolina requires careful planning and pest management, with many gardeners using deer fencing, repellents, and integrated pest management techniques."},
            {"id": "fact13", "North Carolina's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, pest control, and plant selection."},
            {"id": "fact14", "North Carolina's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and African American gardening practices."},
            {"id": "fact15", "North Carolina gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in small yards and urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect North Carolina's natural resources and promote environmental stewardship."},
            {"id": "fact17", "North Carolina's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate North Carolina's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "North Carolina's mountains, piedmont, and coastal plains offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "North Carolina's gardening community is known for its passion and dedication, with gardeners sharing tips, plants, and experiences to create beautiful and bountiful gardens throughout the state."}
        ]
    },
    {
        "state": "NORTH DAKOTA",
        "commonName": "Wild Prairie Rose",
        "scientificName": "Rosa arkansana",
        "image": "north_dakota_state_flower.jpg",
        "stateFlower": "Wild Prairie Rose",
        "statePlant": "American Elm",
        "stateTree": "American Elm",
        "stateCrop": ["Wheat", "Barley", "Corn", "Soybeans", "Canola"],
        "commonFlowers": ["Pasqueflower", "Black-eyed Susan", "Prairie Smoke", "Purple Coneflower", "Western Sunflower"],
        "gardeningFacts": [
            {"id": "fact1", "North Dakota's harsh climate and vast prairies present unique challenges and opportunities for gardening enthusiasts."},
            {"id": "fact2", "Wild prairie roses, the state flower, are hardy perennials that bloom in late spring and early summer, adding color and fragrance to North Dakota's grasslands."},
            {"id": "fact3", "American elms, with their tall stature and arching branches, are native trees that provide shade and beauty to North Dakota's landscapes."},
            {"id": "fact4", "Wheat, barley, and corn are major crops in North Dakota, with the state's fertile soils and continental climate supporting agriculture."},
            {"id": "fact5", "North Dakota's gardeners often cultivate a variety of wildflowers, such as pasqueflowers, black-eyed Susans, prairie smokes, purple coneflowers, and western sunflowers, to add color and diversity to their landscapes."},
            {"id": "fact6", "Pasqueflowers, with their fuzzy leaves and cup-shaped flowers, are one of the first signs of spring in North Dakota's prairies and hillsides."},
            {"id": "fact7", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in North Dakota's meadows and roadsides."},
            {"id": "fact8", "Prairie smokes, with their wispy seed heads and pink flowers, add a touch of elegance to North Dakota's grasslands and prairies."},
            {"id": "fact9", "Purple coneflowers, with their tall stems and purple-pink flowers, attract pollinators like bees and butterflies to North Dakota's gardens and natural areas."},
            {"id": "fact10", "Western sunflowers, with their large, yellow flowers and sturdy stems, brighten up North Dakota's roadsides and fields in late summer and fall."},
            {"id": "fact11", "North Dakota's gardeners often face challenges such as short growing seasons, extreme temperatures, and wind exposure."},
            {"id": "fact12", "Gardening in North Dakota requires careful planning and soil amendment, with many gardeners using raised beds, mulches, and windbreaks to protect their crops."},
            {"id": "fact13", "North Dakota's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, crop selection, and pest management."},
            {"id": "fact14", "North Dakota's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Scandinavian, and immigrant gardening practices."},
            {"id": "fact15", "North Dakota gardeners often use hoop houses, cold frames, and row covers to extend the growing season and protect tender crops from frost and cold temperatures."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as cover cropping, composting, and water conservation, helps protect North Dakota's natural resources and promote environmental stewardship."},
            {"id": "fact17", "North Dakota's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate North Dakota's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "North Dakota's prairies, rivers, and badlands offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "North Dakota's gardening community is known for its resilience and innovation, with gardeners finding creative solutions to overcome challenges and create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "OHIO",
        "commonName": "Scarlet Carnation",
        "scientificName": "Dianthus caryophyllus",
        "image": "ohio_state_flower.jpg",
        "stateFlower": "Scarlet Carnation",
        "statePlant": "Ohio Buckeye",
        "stateTree": "Ohio Buckeye",
        "stateCrop": ["Corn", "Soybeans", "Wheat", "Tomatoes", "Greenhouse and Nursery Products"],
        "commonFlowers": ["Buckeye", "Black-eyed Susan", "Coreopsis", "Purple Coneflower", "Trillium"],
        "gardeningFacts": [
            {"id": "fact1", "Ohio's diverse climate and rich soils support a wide range of gardening activities, from vegetable gardening to flower cultivation."},
            {"id": "fact2", "Scarlet carnations, the state flower, are cherished for their vibrant red blooms and spicy fragrance, and are often used in bouquets and floral arrangements."},
            {"id": "fact3", "Ohio buckeyes, with their distinctive leaves and shiny brown nuts, are native trees that are important for wildlife and ecosystem health in Ohio."},
            {"id": "fact4", "Corn, soybeans, and wheat are major crops in Ohio, with the state's fertile plains and moderate climate supporting agriculture."},
            {"id": "fact5", "Ohio's gardeners often cultivate a variety of flowers, such as buckeyes, black-eyed Susans, coreopsis, purple coneflowers, and trilliums, to enhance their landscapes."},
            {"id": "fact6", "Buckeyes, with their clusters of creamy white flowers and palmate leaves, are a favorite ornamental tree in Ohio's parks and gardens."},
            {"id": "fact7", "Black-eyed Susans, with their cheerful yellow flowers and dark centers, are native wildflowers that thrive in Ohio's meadows and roadsides."},
            {"id": "fact8", "Coreopsis, with its bright yellow flowers and feathery foliage, is a popular choice for sunny borders and rock gardens in Ohio."},
            {"id": "fact9", "Purple coneflowers, with their tall stems and daisy-like flowers, attract pollinators like bees and butterflies to Ohio's gardens and natural areas."},
            {"id": "fact10", "Trilliums, with their three-petaled flowers and mottled leaves, are native woodland plants that bloom in early spring in Ohio."},
            {"id": "fact11", "Ohio's gardeners often face challenges such as fluctuating temperatures, pests, and diseases."},
            {"id": "fact12", "Gardening in Ohio requires careful planning and maintenance, with many gardeners using organic methods and integrated pest management techniques to protect their plants."},
            {"id": "fact13", "Ohio's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, plant selection, and pest control."},
            {"id": "fact14", "Ohio's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Ohio gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect Ohio's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Ohio's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Ohio's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Ohio's rivers, lakes, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Ohio's gardening community is known for its creativity and camaraderie, with gardeners coming together to share knowledge, resources, and experiences to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "OKLAHOMA",
        "commonName": "Oklahoma Rose",
        "scientificName": "Rosa",
        "image": "oklahoma_state_flower.jpg",
        "stateFlower": "Oklahoma Rose",
        "statePlant": "Redbud",
        "stateTree": "Redbud",
        "stateCrop": ["Wheat", "Cotton", "Soybeans", "Peanuts", "Cattle"],
        "commonFlowers": ["Indian Blanket", "Black-eyed Susan", "Coreopsis", "Verbena", "Gaillardia"],
        "gardeningFacts": [
            {"id": "fact1", "Oklahoma's diverse climate and fertile soils support a wide variety of gardening activities, from vegetable gardening to flower cultivation."},
            {"id": "fact2", "Oklahoma roses, the state flower, are renowned for their beauty and fragrance, and are grown in gardens and parks throughout the state."},
            {"id": "fact3", "Redbuds, with their delicate pink flowers and heart-shaped leaves, are native trees that add color and charm to Oklahoma's landscapes."},
            {"id": "fact4", "Wheat, cotton, and soybeans are major crops in Oklahoma, with the state's plains and prairies supporting agriculture."},
            {"id": "fact5", "Oklahoma's gardeners often cultivate a variety of wildflowers, such as Indian blankets, black-eyed Susans, coreopsis, verbenas, and gaillardias, to add color and diversity to their landscapes."},
            {"id": "fact6", "Indian blankets, with their vibrant red and yellow flowers and fern-like foliage, are native wildflowers that thrive in Oklahoma's meadows and roadsides."},
            {"id": "fact7", "Black-eyed Susans, with their golden yellow flowers and dark centers, are drought-tolerant perennials that add a pop of color to Oklahoma's gardens and natural areas."},
            {"id": "fact8", "Coreopsis, with its bright yellow flowers and airy growth habit, is a favorite for sunny borders and meadows in Oklahoma."},
            {"id": "fact9", "Verbenas, with their clusters of small flowers and spreading habit, are versatile plants that attract pollinators to Oklahoma's gardens and landscapes."},
            {"id": "fact10", "Gaillardias, with their daisy-like flowers and vibrant colors, are drought-tolerant perennials that bloom from spring to fall in Oklahoma."},
            {"id": "fact11", "Oklahoma's gardeners often face challenges such as drought, heat, and wind."},
            {"id": "fact12", "Gardening in Oklahoma requires careful water management, soil amendment, and plant selection to thrive in the state's arid conditions."},
            {"id": "fact13", "Oklahoma's cooperative extension services provide valuable resources and support to gardeners, offering advice on drought-tolerant gardening, pest management, and crop selection."},
            {"id": "fact14", "Oklahoma's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Oklahoma gardeners often use raised beds, container gardening, and xeriscaping techniques to conserve water and create beautiful, low-maintenance landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, rainwater harvesting, and organic gardening, helps protect Oklahoma's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Oklahoma's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Oklahoma's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Oklahoma's prairies, woodlands, and rivers offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Oklahoma's gardening community is known for its resilience and creativity, with gardeners finding innovative solutions to overcome challenges and create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "OREGON",
        "commonName": "Oregon Grape",
        "scientificName": "Mahonia aquifolium",
        "image": "oregon_state_flower.jpg",
        "stateFlower": "Oregon Grape",
        "statePlant": "Douglas Fir",
        "stateTree": "Douglas Fir",
        "stateCrop": ["Nursery and Greenhouse Products", "Hay", "Wheat", "Pears", "Apples"],
        "commonFlowers": ["Rhododendron", "Lupine", "Columbine", "Fuchsia", "Bleeding Heart"],
        "gardeningFacts": [
            {"id": "fact1", "Oregon's diverse climate and varied landscapes offer a wealth of opportunities for gardening enthusiasts."},
            {"id": "fact2", "Oregon grapes, the state flower, are valued for their evergreen foliage and clusters of blue-purple berries, which are used in jams, jellies, and wines."},
            {"id": "fact3", "Douglas firs, with their tall stature and pyramid-shaped crowns, are iconic trees that dominate Oregon's forests and landscapes."},
            {"id": "fact4", "Nursery and greenhouse products, hay, and wheat are major agricultural products in Oregon, with the state's mild climate and fertile soils supporting agriculture."},
            {"id": "fact5", "Oregon's gardeners often cultivate a variety of flowers, such as rhododendrons, lupines, columbines, fuchsias, and bleeding hearts, to add color and beauty to their landscapes."},
            {"id": "fact6", "Rhododendrons, with their large, showy flowers and glossy leaves, are a favorite among Oregon gardeners for their shade tolerance and year-round interest."},
            {"id": "fact7", "Lupines, with their tall spikes of colorful flowers and palmate leaves, are native wildflowers that attract pollinators to Oregon's gardens and natural areas."},
            {"id": "fact8", "Columbines, with their delicate flowers and graceful stems, add a touch of elegance to Oregon's woodlands and meadows."},
            {"id": "fact9", "Fuchsias, with their pendulous flowers and vibrant colors, are popular container plants and hanging basket flowers in Oregon."},
            {"id": "fact10", "Bleeding hearts, with their heart-shaped flowers and fern-like foliage, are beloved for their romantic blooms in Oregon's gardens and borders."},
            {"id": "fact11", "Oregon's gardeners often face challenges such as rain, slugs, and deer browsing."},
            {"id": "fact12", "Gardening in Oregon requires careful plant selection, pest management, and soil amendment to thrive in the state's moist conditions."},
            {"id": "fact13", "Oregon's cooperative extension services provide valuable resources and support to gardeners, offering advice on organic gardening, composting, and sustainable landscaping."},
            {"id": "fact14", "Oregon's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and Asian gardening practices."},
            {"id": "fact15", "Oregon gardeners often use raised beds, container gardening, and rain gardens to manage water and create beautiful, water-efficient landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, organic farming, and water conservation, helps protect Oregon's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Oregon's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Oregon's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Oregon's mountains, rivers, and coastlines offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Oregon's gardening community is known for its passion and innovation, with gardeners experimenting with new techniques and plants to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "PENNSYLVANIA",
        "commonName": "Mountain Laurel",
        "scientificName": "Kalmia latifolia",
        "image": "pennsylvania_state_flower.jpg",
        "stateFlower": "Mountain Laurel",
        "statePlant": "Eastern Hemlock",
        "stateTree": "Eastern Hemlock",
        "stateCrop": ["Mushrooms", "Apples", "Dairy Products", "Corn", "Soybeans"],
        "commonFlowers": ["Trillium", "Black-eyed Susan", "Columbine", "Bluebell", "Violet"],
        "gardeningFacts": [
            {"id": "fact1", "Pennsylvania's diverse climate and varied landscapes offer a wealth of opportunities for gardening enthusiasts."},
            {"id": "fact2", "Mountain laurels, the state flower, are prized for their showy flowers and glossy evergreen foliage, and are commonly found in Pennsylvania's woodlands and gardens."},
            {"id": "fact3", "Eastern hemlocks, with their graceful branches and feathery needles, are native trees that provide shade and habitat for wildlife in Pennsylvania."},
            {"id": "fact4", "Mushrooms, apples, and dairy products are major agricultural products in Pennsylvania, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "Pennsylvania's gardeners often cultivate a variety of wildflowers, such as trilliums, black-eyed Susans, columbines, bluebells, and violets, to add color and beauty to their landscapes."},
            {"id": "fact6", "Trilliums, with their three-petaled flowers and mottled leaves, are native woodland plants that bloom in early spring in Pennsylvania."},
            {"id": "fact7", "Black-eyed Susans, with their cheerful yellow flowers and dark centers, are native wildflowers that thrive in Pennsylvania's meadows and roadsides."},
            {"id": "fact8", "Columbines, with their delicate flowers and graceful stems, add a touch of elegance to Pennsylvania's woodlands and gardens."},
            {"id": "fact9", "Bluebells, with their nodding, bell-shaped flowers and slender stems, are a welcome sight in Pennsylvania's woodlands and stream banks."},
            {"id": "fact10", "Violets, with their heart-shaped leaves and delicate flowers, are charming groundcovers that thrive in Pennsylvania's shady spots."},
            {"id": "fact11", "Pennsylvania's gardeners often face challenges such as deer browsing, soil erosion, and invasive plant species."},
            {"id": "fact12", "Gardening in Pennsylvania requires careful planning and maintenance, with many gardeners using deer-resistant plants, erosion control measures, and invasive plant removal techniques."},
            {"id": "fact13", "Pennsylvania's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, plant selection, and pest management."},
            {"id": "fact14", "Pennsylvania's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Pennsylvania gardeners often use raised beds, container gardening, and companion planting to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect Pennsylvania's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Pennsylvania's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Pennsylvania's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Pennsylvania's mountains, rivers, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Pennsylvania's gardening community is known for its passion and dedication, with gardeners sharing tips, plants, and experiences to create beautiful and bountiful gardens throughout the state."}
        ]
    },
    {
        "state": "RHODE ISLAND",
        "commonName": "Violet",
        "scientificName": "Viola sororia",
        "image": "rhode_island_state_flower.jpg",
        "stateFlower": "Violet",
        "statePlant": "Red Maple",
        "stateTree": "Red Maple",
        "stateCrop": ["Nursery and Greenhouse Products", "Vegetables", "Fruits", "Dairy Products", "Eggs"],
        "commonFlowers": ["Rhododendron", "Black-eyed Susan", "Coreopsis", "Goldenrod", "Daylily"],
        "gardeningFacts": [
            {"id": "fact1", "Rhode Island's mild climate and fertile soils provide ideal conditions for gardening activities."},
            {"id": "fact2", "Violets, the state flower, are delicate wildflowers that bloom in shades of purple, blue, and white, adding charm to Rhode Island's woodlands and gardens."},
            {"id": "fact3", "Red maples, with their distinctive red flowers and colorful foliage, are native trees that are important for wildlife and ecosystem health in Rhode Island."},
            {"id": "fact4", "Nursery and greenhouse products, vegetables, fruits, dairy products, and eggs are major agricultural products in Rhode Island, with the state's small farms and diverse landscape supporting agriculture."},
            {"id": "fact5", "Rhode Island's gardeners often cultivate a variety of flowers, such as rhododendrons, black-eyed Susans, coreopsis, goldenrods, and daylilies, to enhance their landscapes."},
            {"id": "fact6", "Rhododendrons, with their large, showy flowers and glossy leaves, are a favorite among Rhode Island gardeners for their shade tolerance and year-round interest."},
            {"id": "fact7", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in Rhode Island's meadows and roadsides."},
            {"id": "fact8", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in Rhode Island."},
            {"id": "fact9", "Goldenrods, with their showy yellow flowers and upright growth habit, add color and texture to Rhode Island's late summer and fall landscapes."},
            {"id": "fact10", "Daylilies, with their trumpet-shaped flowers and grass-like foliage, are reliable perennials that bloom profusely in Rhode Island's gardens."},
            {"id": "fact11", "Rhode Island's gardeners often face challenges such as limited space, salt spray, and deer browsing."},
            {"id": "fact12", "Gardening in Rhode Island requires careful plant selection, soil amendment, and pest management to thrive in the state's coastal conditions."},
            {"id": "fact13", "Rhode Island's cooperative extension services provide valuable resources and support to gardeners, offering advice on coastal gardening, salt-tolerant plants, and sustainable landscaping."},
            {"id": "fact14", "Rhode Island's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Rhode Island gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as rainwater harvesting, composting, and organic farming, helps protect Rhode Island's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Rhode Island's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Rhode Island's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Rhode Island's coastline, islands, and woodlands offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Rhode Island's gardening community is known for its creativity and resilience, with gardeners adapting to the challenges of coastal gardening to create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "SOUTH CAROLINA",
        "commonName": "Yellow Jessamine",
        "scientificName": "Gelsemium sempervirens",
        "image": "south_carolina_state_flower.jpg",
        "stateFlower": "Yellow Jessamine",
        "statePlant": "Cabbage Palmetto",
        "stateTree": "Cabbage Palmetto",
        "stateCrop": ["Poultry", "Turkeys", "Greenhouse and Nursery Products", "Peanuts", "Cotton"],
        "commonFlowers": ["Carolina Jessamine", "Coreopsis", "Carolina Aster", "Black-eyed Susan", "Carolina Lily"],
        "gardeningFacts": [
            {"id": "fact1", "South Carolina's subtropical climate and rich soils provide excellent conditions for gardening year-round."},
            {"id": "fact2", "Yellow jessamine, the state flower, is a fragrant vine with bright yellow flowers that bloom in late winter and early spring, adding color and beauty to South Carolina's landscapes."},
            {"id": "fact3", "Cabbage palmettos, with their large, fan-shaped leaves and distinctive trunks, are native trees that are important for wildlife and ecosystem health in South Carolina."},
            {"id": "fact4", "Poultry, turkeys, greenhouse and nursery products, peanuts, and cotton are major agricultural products in South Carolina, with the state's mild climate and fertile soils supporting agriculture."},
            {"id": "fact5", "South Carolina's gardeners often cultivate a variety of flowers, such as Carolina jessamines, coreopsis, Carolina asters, black-eyed Susans, and Carolina lilies, to enhance their landscapes."},
            {"id": "fact6", "Carolina jessamines, with their yellow, trumpet-shaped flowers and glossy evergreen foliage, are popular vines for arbors, fences, and trellises in South Carolina."},
            {"id": "fact7", "Coreopsis, with its bright yellow flowers and airy growth habit, is a favorite for sunny borders and meadows in South Carolina."},
            {"id": "fact8", "Carolina asters, with their daisy-like flowers and delicate stems, add a touch of charm to South Carolina's woodlands and gardens."},
            {"id": "fact9", "Black-eyed Susans, with their golden yellow flowers and dark centers, are native wildflowers that thrive in South Carolina's meadows and roadsides."},
            {"id": "fact10", "Carolina lilies, with their trumpet-shaped flowers and tall stems, are striking perennials that bloom in mid-summer in South Carolina."},
            {"id": "fact11", "South Carolina's gardeners often face challenges such as heat, humidity, and pests."},
            {"id": "fact12", "Gardening in South Carolina requires careful planning and maintenance, with many gardeners using organic methods and integrated pest management techniques to protect their plants."},
            {"id": "fact13", "South Carolina's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, plant selection, and disease management."},
            {"id": "fact14", "South Carolina's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, African, European, and immigrant gardening practices."},
            {"id": "fact15", "South Carolina gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, rainwater harvesting, and native plant landscaping, helps protect South Carolina's natural resources and promote environmental stewardship."},
            {"id": "fact17", "South Carolina's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate South Carolina's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "South Carolina's coastal plains, piedmont, and mountains offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "South Carolina's gardening community is known for its passion and hospitality, with gardeners sharing tips, plants, and experiences to create beautiful and welcoming gardens throughout the state."}
        ]
    },
    {
        "state": "SOUTH DAKOTA",
        "commonName": "Pasqueflower",
        "scientificName": "Anemone patens",
        "image": "south_dakota_state_flower.jpg",
        "stateFlower": "Pasqueflower",
        "statePlant": "Black Hills Spruce",
        "stateTree": "Black Hills Spruce",
        "stateCrop": ["Wheat", "Corn", "Soybeans", "Hay", "Sunflowers"],
        "commonFlowers": ["American Pasqueflower", "Black-eyed Susan", "Prairie Smoke", "Purple Coneflower", "Western Sunflower"],
        "gardeningFacts": [
            {"id": "fact1", "South Dakota's continental climate and diverse landscapes offer a range of gardening opportunities for enthusiasts."},
            {"id": "fact2", "Pasqueflowers, the state flower, are early spring bloomers with delicate purple flowers and fern-like foliage, signaling the arrival of warmer weather in South Dakota."},
            {"id": "fact3", "Black Hills spruces, with their dense foliage and pyramidal shape, are native trees that are prized for their beauty and resilience in South Dakota."},
            {"id": "fact4", "Wheat, corn, soybeans, hay, and sunflowers are major agricultural products in South Dakota, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "South Dakota's gardeners often cultivate a variety of wildflowers, such as American pasqueflowers, black-eyed Susans, prairie smokes, purple coneflowers, and western sunflowers, to add color and diversity to their landscapes."},
            {"id": "fact6", "American pasqueflowers, with their fuzzy leaves and cup-shaped flowers, are one of the first signs of spring in South Dakota's prairies and hillsides."},
            {"id": "fact7", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in South Dakota's meadows and roadsides."},
            {"id": "fact8", "Prairie smokes, with their wispy seed heads and pink flowers, add a touch of elegance to South Dakota's grasslands and prairies."},
            {"id": "fact9", "Purple coneflowers, with their tall stems and purple-pink flowers, attract pollinators like bees and butterflies to South Dakota's gardens and natural areas."},
            {"id": "fact10", "Western sunflowers, with their large, yellow flowers and sturdy stems, brighten up South Dakota's roadsides and fields in late summer and fall."},
            {"id": "fact11", "South Dakota's gardeners often face challenges such as drought, wind, and extreme temperatures."},
            {"id": "fact12", "Gardening in South Dakota requires careful plant selection, soil amendment, and irrigation to thrive in the state's semi-arid climate."},
            {"id": "fact13", "South Dakota's cooperative extension services provide valuable resources and support to gardeners, offering advice on drought-tolerant gardening, pest management, and crop selection."},
            {"id": "fact14", "South Dakota's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "South Dakota gardeners often use raised beds, mulching, and water-efficient irrigation systems to conserve water and create resilient landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, rainwater harvesting, and organic gardening, helps protect South Dakota's natural resources and promote environmental stewardship."},
            {"id": "fact17", "South Dakota's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate South Dakota's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "South Dakota's prairies, hills, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "South Dakota's gardening community is known for its resilience and creativity, with gardeners finding innovative solutions to overcome challenges and create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "TENNESSEE",
        "commonName": "Iris",
        "scientificName": "Iris germanica",
        "image": "tennessee_state_flower.jpg",
        "stateFlower": "Iris",
        "statePlant": "Tulip Poplar",
        "stateTree": "Tulip Poplar",
        "stateCrop": ["Soybeans", "Corn", "Wheat", "Cotton", "Tobacco"],
        "commonFlowers": ["Purple Coneflower", "Black-eyed Susan", "Coreopsis", "Columbine", "Hydrangea"],
        "gardeningFacts": [
            {"id": "fact1", "Tennessee's diverse climate and landscapes provide a range of gardening opportunities for enthusiasts."},
            {"id": "fact2", "Irises, the state flower, are beloved for their colorful blooms and sword-like leaves, adding elegance to Tennessee's gardens and landscapes."},
            {"id": "fact3", "Tulip poplars, with their tall, straight trunks and distinctive leaves, are native trees that are important for wildlife and ecosystem health in Tennessee."},
            {"id": "fact4", "Soybeans, corn, wheat, cotton, and tobacco are major agricultural products in Tennessee, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "Tennessee's gardeners often cultivate a variety of flowers, such as purple coneflowers, black-eyed Susans, coreopsis, columbines, and hydrangeas, to enhance their landscapes."},
            {"id": "fact6", "Purple coneflowers, with their tall stems and pink-purple flowers, attract pollinators like bees and butterflies to Tennessee's gardens and natural areas."},
            {"id": "fact7", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in Tennessee's meadows and roadsides."},
            {"id": "fact8", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in Tennessee."},
            {"id": "fact9", "Columbines, with their delicate flowers and graceful stems, add a touch of elegance to Tennessee's woodlands and gardens."},
            {"id": "fact10", "Hydrangeas, with their large, showy flowers and lush foliage, are prized for their beauty and versatility in Tennessee's landscapes."},
            {"id": "fact11", "Tennessee's gardeners often face challenges such as heat, humidity, and pests."},
            {"id": "fact12", "Gardening in Tennessee requires careful plant selection, soil amendment, and pest management to thrive in the state's diverse conditions."},
            {"id": "fact13", "Tennessee's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, plant selection, and disease management."},
            {"id": "fact14", "Tennessee's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Tennessee gardeners often use raised beds, container gardening, and companion planting to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as rainwater harvesting, composting, and native plant landscaping, helps protect Tennessee's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Tennessee's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Tennessee's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Tennessee's mountains, rivers, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Tennessee's gardening community is known for its passion and creativity, with gardeners sharing tips, plants, and experiences to create beautiful and bountiful gardens throughout the state."}
        ]
    },
    {
        "state": "TEXAS",
        "commonName": "Bluebonnet",
        "scientificName": "Lupinus texensis",
        "image": "texas_state_flower.jpg",
        "stateFlower": "Bluebonnet",
        "statePlant": "Pecan",
        "stateTree": "Pecan",
        "stateCrop": ["Cotton", "Corn", "Wheat", "Sorghum", "Rice"],
        "commonFlowers": ["Indian Paintbrush", "Pink Evening Primrose", "Mexican Hat", "Coreopsis", "Black-eyed Susan"],
        "gardeningFacts": [
            {"id": "fact1", "Texas's diverse climate and extensive landscapes offer a wide range of gardening opportunities for enthusiasts."},
            {"id": "fact2", "Bluebonnets, the state flower, are iconic symbols of Texas, with their vibrant blue flowers carpeting the countryside in spring."},
            {"id": "fact3", "Pecan trees, with their stately presence and delicious nuts, are native trees that are highly valued in Texas for both their beauty and economic importance."},
            {"id": "fact4", "Cotton, corn, wheat, sorghum, and rice are major agricultural products in Texas, with the state's large farms and fertile soils supporting agriculture."},
            {"id": "fact5", "Texas's gardeners often cultivate a variety of wildflowers, such as Indian paintbrushes, pink evening primroses, Mexican hats, coreopsis, and black-eyed Susans, to add color and diversity to their landscapes."},
            {"id": "fact6", "Indian paintbrushes, with their fiery red-orange flowers and delicate spikes, are commonly seen alongside bluebonnets in Texas's spring wildflower displays."},
            {"id": "fact7", "Pink evening primroses, with their pale pink flowers and trailing stems, create beautiful carpets of color in Texas's fields and roadsides."},
            {"id": "fact8", "Mexican hats, with their distinctive cone-shaped flowers and drooping petals, add a whimsical touch to Texas's prairies and gardens."},
            {"id": "fact9", "Coreopsis, with its bright yellow flowers and fern-like foliage, is a cheerful addition to Texas's sunny borders and meadows."},
            {"id": "fact10", "Black-eyed Susans, with their golden yellow flowers and dark centers, are native wildflowers that thrive in Texas's meadows and roadsides."},
            {"id": "fact11", "Texas's gardeners often face challenges such as heat, drought, and pests."},
            {"id": "fact12", "Gardening in Texas requires careful plant selection, soil amendment, and irrigation to thrive in the state's diverse conditions."},
            {"id": "fact13", "Texas's cooperative extension services provide valuable resources and support to gardeners, offering advice on water conservation, soil health, and pest management."},
            {"id": "fact14", "Texas's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Mexican, European, and immigrant gardening practices."},
            {"id": "fact15", "Texas gardeners often use raised beds, container gardening, and xeriscaping techniques to conserve water and create beautiful, low-maintenance landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as native plant landscaping, rainwater harvesting, and organic gardening, helps protect Texas's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Texas's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Texas's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Texas's prairies, woodlands, and deserts offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Texas's gardening community is known for its resilience and creativity, with gardeners finding innovative solutions to overcome challenges and create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "UTAH",
        "commonName": "Sego Lily",
        "scientificName": "Calochortus nuttallii",
        "image": "utah_state_flower.jpg",
        "stateFlower": "Sego Lily",
        "statePlant": "Blue Spruce",
        "stateTree": "Blue Spruce",
        "stateCrop": ["Hay", "Barley", "Wheat", "Corn", "Alfalfa"],
        "commonFlowers": ["Indian Paintbrush", "Sunflower", "Purple Coneflower", "Black-eyed Susan", "Golden Aster"],
        "gardeningFacts": [
            {"id": "fact1", "Utah's varied climate and landscapes offer unique opportunities for gardening enthusiasts."},
            {"id": "fact2", "Sego lilies, the state flower, are delicate wildflowers with white petals and yellow centers, symbolizing peace and tranquility in Utah's mountains and deserts."},
            {"id": "fact3", "Blue spruces, with their silvery-blue needles and pyramidal shape, are native trees that are prized for their beauty and resilience in Utah."},
            {"id": "fact4", "Hay, barley, wheat, corn, and alfalfa are major agricultural products in Utah, with the state's diverse geography and irrigation systems supporting agriculture."},
            {"id": "fact5", "Utah's gardeners often cultivate a variety of wildflowers, such as Indian paintbrushes, sunflowers, purple coneflowers, black-eyed Susans, and golden asters, to add color and interest to their landscapes."},
            {"id": "fact6", "Indian paintbrushes, with their vibrant red-orange flowers and slender stems, are commonly seen in Utah's mountain meadows and alpine slopes."},
            {"id": "fact7", "Sunflowers, with their large, yellow flowers and sturdy stems, brighten up Utah's fields and gardens in late summer and fall."},
            {"id": "fact8", "Purple coneflowers, with their tall stems and pink-purple flowers, attract pollinators like bees and butterflies to Utah's gardens and natural areas."},
            {"id": "fact9", "Black-eyed Susans, with their golden yellow flowers and dark centers, are native wildflowers that thrive in Utah's meadows and roadsides."},
            {"id": "fact10", "Golden asters, with their cheerful yellow flowers and daisy-like appearance, add a splash of color to Utah's dry slopes and foothills."},
            {"id": "fact11", "Utah's gardeners often face challenges such as drought, poor soil, and altitude."},
            {"id": "fact12", "Gardening in Utah requires careful plant selection, soil amendment, and irrigation to thrive in the state's arid conditions and extreme temperatures."},
            {"id": "fact13", "Utah's cooperative extension services provide valuable resources and support to gardeners, offering advice on water-wise gardening, soil health, and pest management."},
            {"id": "fact14", "Utah's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Mormon pioneer, and immigrant gardening practices."},
            {"id": "fact15", "Utah gardeners often use raised beds, mulching, and drip irrigation systems to conserve water and create resilient landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as xeriscaping, rainwater harvesting, and native plant landscaping, helps protect Utah's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Utah's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Utah's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Utah's mountains, deserts, and canyons offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Utah's gardening community is known for its ingenuity and resilience, with gardeners adapting to the challenges of the desert landscape to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "VERMONT",
        "commonName": "Red Clover",
        "scientificName": "Trifolium pratense",
        "image": "vermont_state_flower.jpg",
        "stateFlower": "Red Clover",
        "statePlant": "Sugar Maple",
        "stateTree": "Sugar Maple",
        "stateCrop": ["Maple Syrup", "Dairy Products", "Apples", "Hay", "Cattle"],
        "commonFlowers": ["Purple Aster", "Goldenrod", "Black-eyed Susan", "Buttercup", "Wild Strawberry"],
        "gardeningFacts": [
            {"id": "fact1", "Vermont's cool climate and fertile soils provide ideal conditions for gardening activities."},
            {"id": "fact2", "Red clover, the state flower, is a common sight in Vermont's fields and meadows, with its pinkish-red flowers attracting pollinators like bees and butterflies."},
            {"id": "fact3", "Sugar maples, with their vibrant fall foliage and sweet sap, are native trees that are highly valued in Vermont for their beauty and economic importance."},
            {"id": "fact4", "Maple syrup, dairy products, apples, hay, and cattle are major agricultural products in Vermont, with the state's small farms and picturesque landscapes supporting agriculture."},
            {"id": "fact5", "Vermont's gardeners often cultivate a variety of wildflowers, such as purple asters, goldenrods, black-eyed Susans, buttercups, and wild strawberries, to enhance their landscapes."},
            {"id": "fact6", "Purple asters, with their daisy-like flowers and slender stems, add a pop of color to Vermont's fields and roadsides in late summer and fall."},
            {"id": "fact7", "Goldenrods, with their showy yellow flowers and upright growth habit, brighten up Vermont's meadows and woodland edges in late summer and fall."},
            {"id": "fact8", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in Vermont's meadows and roadsides."},
            {"id": "fact9", "Buttercups, with their shiny yellow flowers and delicate petals, are charming additions to Vermont's lawns and pastures in spring."},
            {"id": "fact10", "Wild strawberries, with their small white flowers and sweet, red berries, are prized for their flavor and fragrance in Vermont's gardens and woodlands."},
            {"id": "fact11", "Vermont's gardeners often face challenges such as short growing seasons, cold temperatures, and deer browsing."},
            {"id": "fact12", "Gardening in Vermont requires careful planning and maintenance, with many gardeners using cold frames, row covers, and deer-resistant plants to protect their gardens."},
            {"id": "fact13", "Vermont's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, plant selection, and season extension techniques."},
            {"id": "fact14", "Vermont's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Vermont gardeners often use raised beds, mulching, and cover cropping to maximize soil health and productivity in their gardens."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic farming, and integrated pest management, helps protect Vermont's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Vermont's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Vermont's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Vermont's mountains, forests, and valleys offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Vermont's gardening community is known for its creativity and resilience, with gardeners coming together to share knowledge, resources, and experiences to create beautiful and productive gardens throughout the state."}
        ]
    },
    {
        "state": "VIRGINIA",
        "commonName": "American Dogwood",
        "scientificName": "Cornus florida",
        "image": "virginia_state_flower.jpg",
        "stateFlower": "American Dogwood",
        "statePlant": "American Dogwood",
        "stateTree": "American Dogwood",
        "stateCrop": ["Soybeans", "Corn", "Wheat", "Hay", "Tobacco"],
        "commonFlowers": ["Virginia Bluebells", "Black-eyed Susan", "Butterfly Weed", "Cardinal Flower", "Purple Coneflower"],
        "gardeningFacts": [
            {"id": "fact1", "Virginia's moderate climate and diverse landscapes offer a wide range of gardening opportunities for enthusiasts."},
            {"id": "fact2", "American dogwoods, the state flower, are beloved for their showy white or pink flowers and attractive red berries, adding beauty and charm to Virginia's woodlands and gardens."},
            {"id": "fact3", "American dogwoods, with their distinctive four-petaled flowers and glossy green leaves, are native trees that are important for wildlife and ecosystem health in Virginia."},
            {"id": "fact4", "Soybeans, corn, wheat, hay, and tobacco are major agricultural products in Virginia, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "Virginia's gardeners often cultivate a variety of wildflowers, such as Virginia bluebells, black-eyed Susans, butterfly weeds, cardinal flowers, and purple coneflowers, to enhance their landscapes."},
            {"id": "fact6", "Virginia bluebells, with their bell-shaped flowers and delicate blue hues, are early spring bloomers that thrive in Virginia's woodlands and shady gardens."},
            {"id": "fact7", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in Virginia's meadows and roadsides."},
            {"id": "fact8", "Butterfly weeds, with their vibrant orange flowers and slender stems, attract butterflies and other pollinators to Virginia's gardens and natural areas."},
            {"id": "fact9", "Cardinal flowers, with their brilliant red flowers and tall spikes, add a splash of color to Virginia's wetlands and stream banks in late summer and fall."},
            {"id": "fact10", "Purple coneflowers, with their tall stems and pink-purple flowers, attract bees and butterflies to Virginia's gardens and natural areas."},
            {"id": "fact11", "Virginia's gardeners often face challenges such as heat, humidity, and pests."},
            {"id": "fact12", "Gardening in Virginia requires careful plant selection, soil amendment, and pest management to thrive in the state's diverse conditions."},
            {"id": "fact13", "Virginia's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil testing, plant selection, and disease management."},
            {"id": "fact14", "Virginia's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Virginia gardeners often use raised beds, container gardening, and companion planting to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as rainwater harvesting, composting, and native plant landscaping, helps protect Virginia's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Virginia's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Virginia's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Virginia's mountains, rivers, and coastlines offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Virginia's gardening community is known for its passion and camaraderie, with gardeners coming together to share knowledge, resources, and experiences to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "WASHINGTON",
        "commonName": "Coast Rhododendron",
        "scientificName": "Rhododendron macrophyllum",
        "image": "washington_state_flower.jpg",
        "stateFlower": "Coast Rhododendron",
        "statePlant": "Western Hemlock",
        "stateTree": "Western Hemlock",
        "stateCrop": ["Apples", "Wheat", "Hay", "Potatoes", "Hops"],
        "commonFlowers": ["Pacific Bleeding Heart", "Tiger Lily", "Salmonberry", "Indian Plum", "Fuchsia"],
        "gardeningFacts": [
            {"id": "fact1", "Washington's mild climate and abundant rainfall make it an ideal place for gardening enthusiasts."},
            {"id": "fact2", "Coast rhododendrons, the state flower, are showy shrubs with large clusters of pink or purple flowers that bloom in spring, adding color and beauty to Washington's gardens and woodlands."},
            {"id": "fact3", "Western hemlocks, with their graceful branches and feathery needles, are native trees that are important for wildlife and ecosystem health in Washington."},
            {"id": "fact4", "Apples, wheat, hay, potatoes, and hops are major agricultural products in Washington, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "Washington's gardeners often cultivate a variety of native plants, such as Pacific bleeding hearts, tiger lilies, salmonberries, Indian plums, and fuchsias, to enhance their landscapes."},
            {"id": "fact6", "Pacific bleeding hearts, with their heart-shaped flowers and fern-like foliage, are early spring bloomers that thrive in Washington's woodlands and shady gardens."},
            {"id": "fact7", "Tiger lilies, with their orange, spotted flowers and tall stems, add a touch of exotic beauty to Washington's gardens and natural areas."},
            {"id": "fact8", "Salmonberries, with their pinkish-red berries and delicate white flowers, are native shrubs that provide food for wildlife and people alike in Washington."},
            {"id": "fact9", "Indian plums, with their fragrant white flowers and small, edible fruits, are early spring bloomers that are prized for their ornamental and culinary value in Washington."},
            {"id": "fact10", "Fuchsias, with their pendulous flowers and bright colors, are popular ornamental plants that thrive in Washington's mild climate and shady gardens."},
            {"id": "fact11", "Washington's gardeners often face challenges such as heavy rainfall, cool temperatures, and slugs."},
            {"id": "fact12", "Gardening in Washington requires careful plant selection, soil amendment, and pest management to thrive in the state's diverse conditions."},
            {"id": "fact13", "Washington's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact14", "Washington's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Washington gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect Washington's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Washington's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Washington's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Washington's mountains, forests, and coastlines offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Washington's gardening community is known for its creativity and innovation, with gardeners experimenting with new techniques and plants to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "WEST VIRGINIA",
        "commonName": "Rhododendron",
        "scientificName": "Rhododendron maximum",
        "image": "west_virginia_state_flower.jpg",
        "stateFlower": "Rhododendron",
        "statePlant": "Sugar Maple",
        "stateTree": "Sugar Maple",
        "stateCrop": ["Apples", "Hay", "Cattle", "Poultry", "Turkeys"],
        "commonFlowers": ["Black-eyed Susan", "Purple Coneflower", "Butterfly Weed", "Indian Paintbrush", "Coreopsis"],
        "gardeningFacts": [
            {"id": "fact1", "West Virginia's diverse climate and terrain offer a range of gardening opportunities for enthusiasts."},
            {"id": "fact2", "Rhododendrons, the state flower, are native shrubs with clusters of pink or white flowers that bloom in late spring, adding color and beauty to West Virginia's woodlands and gardens."},
            {"id": "fact3", "Sugar maples, with their brilliant fall foliage and sweet sap, are native trees that are highly valued in West Virginia for their beauty and economic importance."},
            {"id": "fact4", "Apples, hay, cattle, poultry, and turkeys are major agricultural products in West Virginia, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "West Virginia's gardeners often cultivate a variety of wildflowers, such as black-eyed Susans, purple coneflowers, butterfly weeds, Indian paintbrushes, and coreopsis, to enhance their landscapes."},
            {"id": "fact6", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in West Virginia's meadows and roadsides."},
            {"id": "fact7", "Purple coneflowers, with their tall stems and pink-purple flowers, attract pollinators like bees and butterflies to West Virginia's gardens and natural areas."},
            {"id": "fact8", "Butterfly weeds, with their vibrant orange flowers and slender stems, are important nectar sources for butterflies and other pollinators in West Virginia."},
            {"id": "fact9", "Indian paintbrushes, with their fiery red-orange flowers and slender spikes, add a pop of color to West Virginia's meadows and woodlands."},
            {"id": "fact10", "Coreopsis, with its bright yellow flowers and airy growth habit, is a popular choice for sunny borders and meadows in West Virginia."},
            {"id": "fact11", "West Virginia's gardeners often face challenges such as heavy rainfall, poor soil, and deer browsing."},
            {"id": "fact12", "Gardening in West Virginia requires careful plant selection, soil amendment, and pest management to thrive in the state's diverse conditions."},
            {"id": "fact13", "West Virginia's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and pest control."},
            {"id": "fact14", "West Virginia's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "West Virginia gardeners often use raised beds, mulching, and companion planting to maximize space and productivity in urban areas."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect West Virginia's natural resources and promote environmental stewardship."},
            {"id": "fact17", "West Virginia's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate West Virginia's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "West Virginia's mountains, valleys, and rivers offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "West Virginia's gardening community is known for its resilience and camaraderie, with gardeners coming together to share knowledge, resources, and experiences to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "WISCONSIN",
        "commonName": "Wood Violet",
        "scientificName": "Viola papilionacea",
        "image": "wisconsin_state_flower.jpg",
        "stateFlower": "Wood Violet",
        "statePlant": "Sugar Maple",
        "stateTree": "Sugar Maple",
        "stateCrop": ["Cranberries", "Ginseng", "Corn", "Dairy Products", "Soybeans"],
        "commonFlowers": ["Purple Coneflower", "Black-eyed Susan", "Goldenrod", "Butterfly Weed", "Wild Geranium"],
        "gardeningFacts": [
            {"id": "fact1", "Wisconsin's diverse climate and fertile soils provide ideal conditions for gardening activities."},
            {"id": "fact2", "Wood violets, the state flower, are delicate wildflowers with purple or white flowers that bloom in spring, adding charm and beauty to Wisconsin's woodlands and gardens."},
            {"id": "fact3", "Sugar maples, with their brilliant fall foliage and sweet sap, are native trees that are highly valued in Wisconsin for their beauty and economic importance."},
            {"id": "fact4", "Cranberries, ginseng, corn, dairy products, and soybeans are major agricultural products in Wisconsin, with the state's fertile soils and temperate climate supporting agriculture."},
            {"id": "fact5", "Wisconsin's gardeners often cultivate a variety of native plants, such as purple coneflowers, black-eyed Susans, goldenrods, butterfly weeds, and wild geraniums, to enhance their landscapes."},
            {"id": "fact6", "Purple coneflowers, with their tall stems and pink-purple flowers, attract pollinators like bees and butterflies to Wisconsin's gardens and natural areas."},
            {"id": "fact7", "Black-eyed Susans, with their bright yellow flowers and dark centers, are native wildflowers that thrive in Wisconsin's meadows and roadsides."},
            {"id": "fact8", "Goldenrods, with their showy yellow flowers and upright growth habit, brighten up Wisconsin's meadows and woodland edges in late summer and fall."},
            {"id": "fact9", "Butterfly weeds, with their vibrant orange flowers and slender stems, are important nectar sources for butterflies and other pollinators in Wisconsin."},
            {"id": "fact10", "Wild geraniums, with their delicate pink or purple flowers and palmate leaves, add a touch of elegance to Wisconsin's woodlands and gardens."},
            {"id": "fact11", "Wisconsin's gardeners often face challenges such as cold temperatures, pests, and diseases."},
            {"id": "fact12", "Gardening in Wisconsin requires careful plant selection, soil amendment, and pest management to thrive in the state's diverse conditions."},
            {"id": "fact13", "Wisconsin's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact14", "Wisconsin's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, European, and immigrant gardening practices."},
            {"id": "fact15", "Wisconsin gardeners often use raised beds, container gardening, and succession planting to extend the growing season and maximize productivity."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect Wisconsin's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Wisconsin's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Wisconsin's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Wisconsin's lakes, rivers, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Wisconsin's gardening community is known for its passion and resilience, with gardeners coming together to share knowledge, resources, and experiences to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "WYOMING",
        "commonName": "Indian Paintbrush",
        "scientificName": "Castilleja linariifolia",
        "image": "wyoming_state_flower.jpg",
        "stateFlower": "Indian Paintbrush",
        "statePlant": "Cottonwood",
        "stateTree": "Cottonwood",
        "stateCrop": ["Hay", "Wheat", "Barley", "Corn", "Alfalfa"],
        "commonFlowers": ["Wyoming Indian Paintbrush", "Sagebrush", "Blue Flax", "Lupine", "Wild Rose"],
        "gardeningFacts": [
            {"id": "fact1", "Wyoming's diverse landscapes and high altitude present unique challenges and opportunities for gardening enthusiasts."},
            {"id": "fact2", "Indian paintbrushes, the state flower, are striking wildflowers with brightly colored bracts that range from red to orange, adding a splash of color to Wyoming's plains and mountains."},
            {"id": "fact3", "Cottonwoods, with their tall stature and shimmering leaves, are native trees that are important for wildlife and ecosystem health in Wyoming."},
            {"id": "fact4", "Hay, wheat, barley, corn, and alfalfa are major agricultural products in Wyoming, with the state's vast prairies and fertile valleys supporting agriculture."},
            {"id": "fact5", "Wyoming's gardeners often cultivate a variety of native plants, such as Wyoming Indian paintbrushes, sagebrush, blue flax, lupines, and wild roses, to enhance their landscapes."},
            {"id": "fact6", "Wyoming Indian paintbrushes, with their vibrant red-orange bracts and slender stems, are commonly seen in Wyoming's grasslands and alpine meadows."},
            {"id": "fact7", "Sagebrush, with its silvery foliage and aromatic scent, is a hardy shrub that is well-adapted to Wyoming's dry climate and alkaline soils."},
            {"id": "fact8", "Blue flax, with its delicate blue flowers and slender stems, adds a touch of elegance to Wyoming's roadsides and prairies in early summer."},
            {"id": "fact9", "Lupines, with their tall spikes of colorful flowers and palmate leaves, are prized for their beauty and wildlife value in Wyoming."},
            {"id": "fact10", "Wild roses, with their fragrant pink or white flowers and thorny stems, are common sights in Wyoming's foothills and mountain slopes."},
            {"id": "fact11", "Wyoming's gardeners often face challenges such as short growing seasons, extreme temperatures, and water scarcity."},
            {"id": "fact12", "Gardening in Wyoming requires careful plant selection, soil amendment, and irrigation to thrive in the state's arid conditions and high altitude."},
            {"id": "fact13", "Wyoming's cooperative extension services provide valuable resources and support to gardeners, offering advice on water-wise gardening, soil health, and pest management."},
            {"id": "fact14", "Wyoming's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, cowboy, and homesteader gardening practices."},
            {"id": "fact15", "Wyoming gardeners often use raised beds, mulching, and drip irrigation systems to conserve water and create resilient landscapes."},
            {"id": "fact16", "The state's commitment to sustainable gardening practices, such as xeriscaping, rainwater harvesting, and native plant landscaping, helps protect Wyoming's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Wyoming's botanical gardens and arboretums showcase the state's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The state's annual garden festivals, plant sales, and horticultural events celebrate Wyoming's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Wyoming's mountains, prairies, and deserts offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Wyoming's gardening community is known for its ingenuity and resilience, with gardeners adapting to the challenges of the high plains to create beautiful and sustainable gardens throughout the state."}
        ]
    },
    {
        "state": "PUERTO RICO",
        "commonName": "Maguey",
        "scientificName": "Agave americana",
        "image": "puerto_rico_state_flower.jpg",
        "stateFlower": "Maguey",
        "statePlant": "Flamboyn",
        "stateTree": "Flamboyn",
        "stateCrop": ["Coffee", "Sugarcane", "Bananas", "Plantains", "Tobacco"],
        "commonFlowers": ["Bougainvillea", "Hibiscus", "Ixora", "Plumeria", "Allamanda"],
        "gardeningFacts": [
            {"id": "fact1", "Puerto Rico's tropical climate and fertile soils provide ideal conditions for gardening year-round."},
            {"id": "fact2", "Maguey, the state flower, is a succulent plant with large, spiky leaves that is well-adapted to Puerto Rico's dry coastal regions."},
            {"id": "fact3", "Flamboyns, with their flamboyant clusters of red or orange flowers, are iconic trees that are prized for their beauty and shade in Puerto Rico."},
            {"id": "fact4", "Coffee, sugarcane, bananas, plantains, and tobacco are major agricultural products in Puerto Rico, with the island's tropical climate and mountainous terrain supporting agriculture."},
            {"id": "fact5", "Puerto Rico's gardeners often cultivate a variety of flowering plants, such as bougainvilleas, hibiscus, ixoras, plumerias, and allamandas, to enhance their landscapes."},
            {"id": "fact6", "Bougainvilleas, with their vibrant bracts and sprawling growth habit, are popular ornamental vines that thrive in Puerto Rico's warm climate."},
            {"id": "fact7", "Hibiscus, with their large, showy flowers and glossy green leaves, are commonly grown as hedges and ornamental shrubs in Puerto Rico."},
            {"id": "fact8", "Ixoras, with their clusters of small, colorful flowers and glossy foliage, are popular landscape plants that add a tropical touch to Puerto Rico's gardens."},
            {"id": "fact9", "Plumerias, with their fragrant flowers and smooth, gray bark, are small trees or shrubs that are often grown for their beauty and scent in Puerto Rico."},
            {"id": "fact10", "Allamandas, with their trumpet-shaped flowers and glossy leaves, are vigorous climbers that can quickly cover fences and trellises in Puerto Rico."},
            {"id": "fact11", "Puerto Rico's gardeners often face challenges such as heavy rainfall, high humidity, and pests."},
            {"id": "fact12", "Gardening in Puerto Rico requires careful plant selection, soil amendment, and pest management to thrive in the state's tropical conditions."},
            {"id": "fact13", "Puerto Rico's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact14", "Puerto Rico's rich cultural heritage is reflected in its gardening traditions, with influences from Native American, Spanish, and African gardening practices."},
            {"id": "fact15", "Puerto Rican gardeners often use raised beds, container gardening, and vertical gardening techniques to maximize space and productivity in urban areas."},
            {"id": "fact16", "The island's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect Puerto Rico's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Puerto Rico's botanical gardens and arboretums showcase the island's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The island's annual garden festivals, plant sales, and horticultural events celebrate Puerto Rico's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Puerto Rico's beaches, mountains, and rainforests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Puerto Rico's gardening community is known for its vibrancy and creativity, with gardeners coming together to celebrate the island's natural beauty and promote sustainable gardening practices."}
        ]
    },
    {
        "state": "GUAM",
        "commonName": "Bougainvillea",
        "scientificName": "Bougainvillea spectabilis",
        "image": "guam_state_flower.jpg",
        "stateFlower": "Bougainvillea",
        "statePlant": "Breadfruit",
        "stateTree": "Breadfruit",
        "stateCrop": ["Coconuts", "Papayas", "Bananas", "Sweet Potatoes", "Taro"],
        "commonFlowers": ["Hibiscus", "Frangipani", "Plumeria", "Orchids", "Bird of Paradise"],
        "gardeningFacts": [
            {"id": "fact1", "Guam's tropical climate and rich volcanic soil provide ideal conditions for gardening year-round."},
            {"id": "fact2", "Bougainvilleas, the state flower, are vibrant vines with colorful bracts that add beauty and color to Guam's landscapes."},
            {"id": "fact3", "Breadfruit trees, with their large, lobed leaves and green, round fruits, are important food sources in Guam."},
            {"id": "fact4", "Coconuts, papayas, bananas, sweet potatoes, and taro are major agricultural products in Guam, with the island's tropical climate supporting agriculture."},
            {"id": "fact5", "Guam's gardeners often cultivate a variety of flowering plants, such as hibiscus, frangipani, plumeria, orchids, and bird of paradise, to enhance their landscapes."},
            {"id": "fact6", "Hibiscus, with their large, showy flowers and glossy green leaves, are commonly grown as hedges and ornamental shrubs in Guam."},
            {"id": "fact7", "Frangipani, with their fragrant flowers and smooth, gray bark, are small trees or shrubs that are often grown for their beauty and scent in Guam."},
            {"id": "fact8", "Plumerias, with their colorful flowers and glossy leaves, are popular landscape plants that add a tropical touch to Guam's gardens."},
            {"id": "fact9", "Orchids, with their delicate flowers and diverse forms, are prized for their beauty and elegance in Guam."},
            {"id": "fact10", "Bird of paradise, with their striking flowers and banana-like leaves, are vigorous perennials that add a touch of exoticism to Guam's gardens."},
            {"id": "fact11", "Guam's gardeners often face challenges such as typhoons, pests, and diseases."},
            {"id": "fact12", "Gardening in Guam requires careful plant selection, soil amendment, and pest management to thrive in the state's tropical conditions."},
            {"id": "fact13", "Guam's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact14", "Guam's rich cultural heritage is reflected in its gardening traditions, with influences from Chamorro, Spanish, and Filipino gardening practices."},
            {"id": "fact15", "Guamanian gardeners often use raised beds, container gardening, and trellises to maximize space and productivity in urban areas."},
            {"id": "fact16", "The island's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect Guam's natural resources and promote environmental stewardship."},
            {"id": "fact17", "Guam's botanical gardens and nurseries showcase the island's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The island's annual garden festivals, plant sales, and horticultural events celebrate Guam's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "Guam's beaches, mountains, and forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "Guam's gardening community is known for its resilience and innovation, with gardeners adapting to the challenges of the island's climate and terrain to create beautiful and sustainable gardens."}
        ]
    },
    {
        "state": "AMERICAN SAMOA",
        "commonName": "Ta'amu",
        "scientificName": "Plumeria samoensis",
        "image": "american_samoa_state_flower.jpg",
        "stateFlower": "Ta'amu",
        "statePlant": "Coconut Palm",
        "stateTree": "Coconut Palm",
        "stateCrop": ["Taro", "Breadfruit", "Bananas", "Pineapples", "Cocoa"],
        "commonFlowers": ["Hibiscus", "Ginger", "Orchids", "Frangipani", "Bird of Paradise"],
        "gardeningFacts": [
            {"id": "fact1", "American Samoa's tropical climate and volcanic soils provide ideal conditions for gardening year-round."},
            {"id": "fact2", "Ta'amu, the state flower, is a fragrant flower with white petals and a yellow center that is often used in leis and other traditional Samoan crafts."},
            {"id": "fact3", "Coconut palms, with their tall, slender trunks and feathery fronds, are iconic trees that are important for food, shelter, and cultural significance in American Samoa."},
            {"id": "fact4", "Taro, breadfruit, bananas, pineapples, and cocoa are major agricultural products in American Samoa, with the island's tropical climate supporting agriculture."},
            {"id": "fact5", "American Samoa's gardeners often cultivate a variety of flowering plants, such as hibiscus, ginger, orchids, frangipani, and bird of paradise, to enhance their landscapes."},
            {"id": "fact6", "Hibiscus, with their large, showy flowers and glossy green leaves, are commonly grown as hedges and ornamental shrubs in American Samoa."},
            {"id": "fact7", "Ginger, with its spicy-sweet fragrance and striking flowers, is a versatile plant that is used in cooking, medicine, and landscaping in American Samoa."},
            {"id": "fact8", "Orchids, with their delicate flowers and diverse forms, are prized for their beauty and elegance in American Samoa."},
            {"id": "fact9", "Frangipani, with their fragrant flowers and smooth, gray bark, are small trees or shrubs that are often grown for their beauty and scent in American Samoa."},
            {"id": "fact10", "Bird of paradise, with their striking flowers and banana-like leaves, are vigorous perennials that add a touch of exoticism to American Samoa's gardens."},
            {"id": "fact11", "American Samoa's gardeners often face challenges such as cyclones, pests, and diseases."},
            {"id": "fact12", "Gardening in American Samoa requires careful plant selection, soil amendment, and pest management to thrive in the state's tropical conditions."},
            {"id": "fact13", "American Samoa's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact14", "The territory's rich cultural heritage is reflected in its gardening traditions, with influences from Samoan, Tongan, and European gardening practices."},
            {"id": "fact15", "American Samoan gardeners often use traditional methods such as terracing, intercropping, and agroforestry to maximize space and productivity in small landholdings."},
            {"id": "fact16", "The territory's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect American Samoa's natural resources and promote environmental stewardship."},
            {"id": "fact17", "American Samoa's botanical gardens and nurseries showcase the territory's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The territory's annual garden festivals, plant sales, and horticultural events celebrate American Samoa's gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "American Samoa's beaches, coral reefs, and tropical forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "American Samoa's gardening community is known for its resilience and community spirit, with gardeners sharing knowledge, resources, and experiences to create beautiful and sustainable gardens throughout the territory."}
        ]
    },
    {
        "state": "NORTHERN MARIANA ISLANDS",
        "commonName": "Flowers of Flame",
        "scientificName": "Bougainvillea",
        "image": "northern_mariana_islands_state_flower.jpg",
        "stateFlower": "Flowers of Flame",
        "statePlant": "Breadfruit",
        "stateTree": "Breadfruit",
        "stateCrop": ["Coconuts", "Papayas", "Taro", "Bananas", "Sweet Potatoes"],
        "commonFlowers": ["Hibiscus", "Plumeria", "Orchids", "Ginger", "Frangipani"],
        "gardeningFacts": [
            {"id": "fact1", "The Northern Mariana Islands' tropical climate and volcanic soil provide ideal conditions for gardening."},
            {"id": "fact2", "Flowers of Flame, the state flower, is a variety of bougainvillea with vibrant red, orange, and pink bracts that resemble flames."},
            {"id": "fact3", "Breadfruit trees, with their large, lobed leaves and green, round fruits, are important food sources in the Northern Mariana Islands."},
            {"id": "fact4", "Coconuts, papayas, taro, bananas, and sweet potatoes are major agricultural products in the Northern Mariana Islands, with the territory's tropical climate supporting agriculture."},
            {"id": "fact5", "The Northern Mariana Islands' gardeners often cultivate a variety of flowering plants, such as hibiscus, plumeria, orchids, ginger, and frangipani, to enhance their landscapes."},
            {"id": "fact6", "Hibiscus, with their large, showy flowers and glossy green leaves, are commonly grown as hedges and ornamental shrubs in the Northern Mariana Islands."},
            {"id": "fact7", "Plumeria, with their colorful flowers and glossy leaves, are popular landscape plants that add a tropical touch to the Northern Mariana Islands' gardens."},
            {"id": "fact8", "Orchids, with their delicate flowers and diverse forms, are prized for their beauty and elegance in the Northern Mariana Islands."},
            {"id": "fact9", "Ginger, with its spicy-sweet fragrance and striking flowers, is a versatile plant that is used in cooking, medicine, and landscaping in the Northern Mariana Islands."},
            {"id": "fact10", "Frangipani, with their fragrant flowers and smooth, gray bark, are small trees or shrubs that are often grown for their beauty and scent in the Northern Mariana Islands."},
            {"id": "fact11", "The Northern Mariana Islands' gardeners often face challenges such as typhoons, pests, and diseases."},
            {"id": "fact12", "Gardening in the Northern Mariana Islands requires careful plant selection, soil amendment, and pest management to thrive in the territory's tropical conditions."},
            {"id": "fact13", "The territory's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact14", "The territory's rich cultural heritage is reflected in its gardening traditions, with influences from Chamorro, Carolinian, and Filipino gardening practices."},
            {"id": "fact15", "Northern Mariana Islands' gardeners often use traditional methods such as raised beds, intercropping, and companion planting to maximize space and productivity in small landholdings."},
            {"id": "fact16", "The territory's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect the Northern Mariana Islands' natural resources and promote environmental stewardship."},
            {"id": "fact17", "The Northern Mariana Islands' botanical gardens and nurseries showcase the territory's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact18", "The territory's annual garden festivals, plant sales, and horticultural events celebrate the Northern Mariana Islands' gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact19", "The Northern Mariana Islands' beaches, coral reefs, and tropical forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact20", "The Northern Mariana Islands' gardening community is known for its resilience and innovation, with gardeners adapting to the challenges of the territory's climate and terrain to create beautiful and sustainable gardens throughout the territory."}
        ]
    },
    {
        "state": "U.S. VIRGIN ISLANDS",
        "commonName": "Yellow Cedar",
        "scientificName": "Tabebuia heterophylla",
        "image": "us_virgin_islands_state_flower.jpg",
        "stateFlower": "Yellow Cedar",
        "statePlant": "Yellow Cedar",
        "stateTree": "Yellow Cedar",
        "stateCrop": ["Sugar Cane", "Bananas", "Mangoes", "Coconuts", "Pineapples"],
        "commonFlowers": ["Hibiscus", "Allamanda", "Ixora", "Bougainvillea", "Plumeria"],
        "gardeningFacts": [
            {"id": "fact1", "The U.S. Virgin Islands' tropical climate and fertile soils provide ideal conditions for gardening year-round."},
            {"id": "fact2", "Yellow cedar, the state flower, is a flowering tree with bright yellow flowers that bloom in spring, adding color and beauty to the U.S. Virgin Islands' landscapes."},
            {"id": "fact3", "Sugar cane, bananas, mangoes, coconuts, and pineapples are major agricultural products in the U.S. Virgin Islands, with the territory's tropical climate supporting agriculture."},
            {"id": "fact4", "The U.S. Virgin Islands' gardeners often cultivate a variety of flowering plants, such as hibiscus, allamanda, ixora, bougainvillea, and plumeria, to enhance their landscapes."},
            {"id": "fact5", "Hibiscus, with their large, showy flowers and glossy green leaves, are commonly grown as hedges and ornamental shrubs in the U.S. Virgin Islands."},
            {"id": "fact6", "Allamanda, with their trumpet-shaped flowers and glossy leaves, are vigorous climbers that add a splash of color to the U.S. Virgin Islands' gardens."},
            {"id": "fact7", "Ixora, with their clusters of small, colorful flowers and glossy foliage, are popular landscape plants that add a tropical touch to the U.S. Virgin Islands' gardens."},
            {"id": "fact8", "Bougainvillea, with their vibrant bracts and sprawling growth habit, are popular ornamental vines that thrive in the U.S. Virgin Islands' warm climate."},
            {"id": "fact9", "Plumeria, with their fragrant flowers and smooth, gray bark, are small trees or shrubs that are often grown for their beauty and scent in the U.S. Virgin Islands."},
            {"id": "fact10", "The U.S. Virgin Islands' gardeners often face challenges such as hurricanes, drought, and pests."},
            {"id": "fact11", "Gardening in the U.S. Virgin Islands requires careful plant selection, soil amendment, and pest management to thrive in the territory's tropical conditions."},
            {"id": "fact12", "The territory's cooperative extension services provide valuable resources and support to gardeners, offering advice on soil health, plant selection, and disease management."},
            {"id": "fact13", "The territory's rich cultural heritage is reflected in its gardening traditions, with influences from African, European, and Caribbean gardening practices."},
            {"id": "fact14", "U.S. Virgin Islands' gardeners often use raised beds, container gardening, and trellises to maximize space and productivity in urban areas."},
            {"id": "fact15", "The territory's commitment to sustainable gardening practices, such as composting, organic farming, and water-efficient irrigation, helps protect the U.S. Virgin Islands' natural resources and promote environmental stewardship."},
            {"id": "fact16", "The U.S. Virgin Islands' botanical gardens and nurseries showcase the territory's diverse plant life and provide educational opportunities for gardeners and nature enthusiasts."},
            {"id": "fact17", "The territory's annual garden festivals, plant sales, and horticultural events celebrate the U.S. Virgin Islands' gardening culture and provide opportunities for enthusiasts to learn, connect, and share their passion for plants."},
            {"id": "fact18", "U.S. Virgin Islands' beaches, coral reefs, and tropical forests offer inspiration and habitat for gardeners and wildlife alike, with unique plant species adapted to the region's diverse ecosystems."},
            {"id": "fact19", "The U.S. Virgin Islands' gardening community is known for its creativity and resourcefulness, with gardeners finding innovative solutions to the challenges of gardening in a tropical island environment."},
            {"id": "fact20", "Gardening in the U.S. Virgin Islands is not just a hobby but a way of life, with gardeners sharing their knowledge, experiences, and harvests to build strong and resilient communities throughout the territory."}
        ]
    }
]
